# version: 0.1
104 101
32 116
32 97
32 115
110 100
32 119
258 257
101 100
259 261
258 111
32 98
105 110
32 104
262 97
114 101
32 102
105 116
111 117
32 84
32 99
32 108
32 257
32 100
101 114
270 115
32 109
32 112
111 109
32 111
97 121
97 114
275 257
268 103
105 115
32 103
105 108
105 100
97 116
32 83
101 110
32 110
260 97
269 97
105 109
97 110
111 114
111 110
32 273
258 104
108 108
32 72
108 101
278 114
101 116
32 34
111 116
295 257
105 114
307 101
101 261
118 280
101 115
32 268
117 116
288 121
111 119
99 107
32 117
108 100
32 76
111 111
101 120
105 103
298 293
97 109
292 121
32 121
267 101
32 114
260 116
99 101
260 257
112 112
32 73
107 101
273 104
79 110
262 342
118 101
285 110
285 102
260 111
269 290
107 264
102 116
114 105
326 332
110 116
317 121
283 108
279 286
97 100
333 274
305 294
32 66
324 112
299 100
101 108
115 116
356 286
328 116
263 121
282 284
109 121
32 101
262 101
272 302
274 325
117 110
60 124
316 111
377 351
378 367
124 62
380 10
32 77
39 115
273 116
296 116
299 339
99 104
277 105
274 116
270 354
260 104
257 114
108 121
300 101
384 308
274 261
32 355
258 394
284 101
277 395
263 271
115 101
279 111
262 104
97 306
32 107
46 376
97 108
104 116
32 271
297 312
32 32
386 121
267 329
267 320
260 109
97 323
32 65
298 119
340 116
259 115
259 110
114 97
297 101
352 316
272 425
275 300
293 101
343 101
114 121
39 116
118 264
32 290
343 337
97 341
46 34
372 271
117 103
277 327
277 111
32 429
111 271
101 99
269 300
267 111
33 34
32 74
266 111
362 303
291 111
314 108
32 106
390 264
291 451
260 101
32 389
287 100
119 286
260 112
292 108
105 261
263 109
276 374
257 110
102 117
259 116
117 114
279 293
416 292
263 314
259 271
97 268
32 328
262 385
287 116
257 100
114 284
275 284
105 99
114 396
299 345
116 280
297 331
108 112
259 306
361 296
32 87
465 108
406 110
104 289
327 100
278 484
329 409
427 370
426 115
361 320
303 101
287 107
267 417
117 109
276 301
483 264
276 108
63 34
272 375
97 271
440 432
364 116
259 108
111 112
115 428
277 101
297 111
260 99
272 508
274 103
469 264
105 323
421 350
89 274
266 121
282 301
259 480
331 101
272 101
260 286
445 121
260 399
439 350
117 271
284 310
267 114
262 374
282 101
267 314
388 341
103 310
336 475
335 111
97 115
455 101
105 337
303 103
535 100
260 531
100 100
262 302
358 101
105 101
107 289
259 103
322 110
258 271
272 97
259 458
404 294
289 115
538 264
537 392
335 301
195 162
226 130
562 172
287 264
282 435
273 264
274 100
282 548
266 559
545 490
473 99
97 103
276 111
283 498
32 69
424 119
298 100
382 284
283 320
44 34
272 477
32 70
98 308
116 392
283 114
282 117
276 287
269 399
32 520
263 110
105 102
262 464
272 396
101 306
551 472
285 584
276 104
279 443
404 111
277 97
352 264
115 115
291 491
269 438
339 264
270 108
101 112
405 121
526 115
272 108
318 116
97 387
571 566
112 108
113 117
327 107
291 310
516 409
366 289
295 117
291 312
260 119
274 115
104 294
32 68
110 121
293 264
117 323
305 557
371 355
598 627
276 524
334 99
97 345
114 111
97 120
32 118
388 350
279 552
403 103
514 564
117 365
346 101
272 461
267 108
305 301
274 402
458 115
489 101
468 110
97 112
369 370
276 506
295 331
509 648
259 98
290 116
279 358
525 364
287 97
98 98
382 636
287 110
102 101
359 114
456 511
291 423
301 116
32 341
448 107
267 117
277 312
110 110
295 111
656 389
487 464
318 115
261 280
553 101
443 105
439 107
283 111
282 121
274 114
521 115
273 101
99 476
649 119
305 618
296 264
512 663
319 116
285 325
282 442
673 97
290 101
283 117
103 264
258 97
546 296
680 408
459 701
97 117
262 460
280 115
271 116
283 101
269 111
258 435
295 660
267 405
489 322
600 438
351 280
700 393
307 280
276 294
269 322
575 355
447 111
105 345
258 114
586 387
422 121
109 97
260 108
418 695
260 302
282 111
118 296
290 104
391 322
463 110
703 402
268 107
447 417
269 647
692 111
500 112
285 317
258 601
97 261
371 294
260 107
260 375
258 119
503 111
335 375
105 97
299 261
32 296
319 511
100 121
32 591
266 325
424 317
32 615
105 303
633 734
98 121
585 567
620 715
257 271
291 634
582 477
728 430
305 290
285 112
366 264
294 101
473 614
278 457
116 121
285 114
270 482
301 107
103 101
288 110
115 264
283 518
312 392
539 284
310 482
452 642
97 337
604 698
291 271
97 107
347 102
283 706
292 101
371 612
277 543
276 284
445 120
302 116
336 114
307 290
105 122
324 354
270 116
312 104
424 264
452 111
487 101
416 405
268 101
334 287
800 292
297 542
117 101
258 430
364 102
118 289
117 99
516 104
691 264
406 461
292 100
272 111
522 121
39 109
267 783
382 749
32 300
300 408
103 430
418 261
422 826
467 116
32 316
32 67
260 110
97 320
276 308
101 109
118 385
467 112
291 114
334 834
101 287
452 739
259 100
98 280
271 331
112 116
610 322
105 318
276 257
267 423
646 350
371 730
267 611
276 405
358 121
672 115
713 476
115 813
32 561
335 97
270 121
467 110
554 365
267 121
306 121
276 117
272 331
118 318
457 296
291 869
840 105
119 110
115 104
871 488
277 567
308 119
744 121
279 303
104 110
268 121
653 488
440 345
272 105
563 197
884 147
97 402
443 116
298 664
324 678
276 399
89 318
84 104
269 457
262 111
277 657
336 286
301 101
510 308
291 108
110 289
336 460
327 108
269 830
418 115
260 117
825 112
418 714
867 332
267 802
114 109
329 104
388 432
257 115
707 898
829 115
271 101
573 108
850 345
606 350
410 109
111 98
99 116
720 879
277 310
838 114
258 101
746 111
260 925
391 374
290 476
271 602
267 358
73 116
669 846
272 442
272 876
272 268
336 302
272 393
97 365
290 264
105 112
304 115
108 264
33 376
111 323
815 121
102 442
450 289
835 301
279 301
348 303
854 264
283 479
326 947
391 506
107 286
422 827
539 323
790 773
276 303
78 111
32 428
105 264
292 393
291 480
335 264
771 442
32 80
276 430
843 837
336 111
115 111
410 408
76 310
262 461
391 880
98 101
578 370
267 616
509 973
403 306
963 97
334 948
768 690
546 264
404 791
500 370
669 607
371 121
297 322
659 289
403 302
563 226
111 121
625 358
606 550
513 696
308 115
272 114
572 101
917 302
105 623
258 862
116 490
32 71
102 102
116 104
267 264
279 423
780 264
287 121
361 921
101 310
747 115
503 300
279 364
116 530
334 289
1016 98
87 624
272 491
324 110
272 287
106 995
971 530
469 101
97 99
295 112
279 591
994 132
1031 162
262 114
438 409
305 114
439 550
297 367
479 264
513 986
757 518
279 290
410 614
32 82
270 273
836 844
935 365
799 264
258 423
103 280
990 318
32 78
661 273
285 872
335 472
906 796
787 294
954 1018
972 605
892 776
751 1025
637 111
710 104
620 101
291 721
1055 668
547 107
920 1045
424 287
103 301
371 317
259 339
259 714
1040 393
895 296
267 271
661 264
116 289
111 303
282 97
1042 964
272 731
860 1052
750 115
411 1038
532 111
726 428
1029 312
606 107
305 735
722 628
84 624
259 99
116 264
107 318
797 543
732 264
291 105
630 497
894 678
664 271
760 101
1030 1100
314 365
260 530
299 115
335 493
633 524
334 296
260 396
725 122
266 119
335 117
258 408
259 1110
278 358
391 389
532 493
801 687
447 897
282 302
333 841
597 819
97 583
534 301
262 763
306 322
266 117
269 911
554 337
276 616
100 286
801 387
286 978
645 811
280 264
97 1034
1102 354
336 442
603 1101
279 931
117 306
110 103
301 777
260 615
285 957
290 121
279 101
308 886
1061 542
294 104
275 104
297 493
445 294
324 115
847 705
356 785
820 1126
259 114
324 402
1015 280
375 626
308 607
314 264
554 118
76 332
333 594
667 1076
866 352
719 497
270 910
373 103
276 114
282 572
336 518
842 264
276 435
87 101
724 109
1178 442
258 594
340 110
415 482
261 725
259 109
305 916
421 107
99 111
32 684
1168 623
108 549
274 354
302 110
961 116
525 306
101 121
97 687
544 115
540 115
290 115
492 264
697 306
272 1103
273 99
645 946
269 510
267 273
279 114
974 1047
406 293
76 616
292 97
282 303
532 781
32 122
466 101
403 318
300 318
386 690
336 510
122 121
1164 302
333 988
406 1203
1223 464
339 121
622 1014
283 280
410 608
97 1146
1221 686
667 602
77 284
334 1069
410 365
410 855
582 268
512 97
410 1196
889 365
97 314
938 121
267 1161
283 472
39 271
260 289
365 280
298 261
278 271
346 393
610 111
899 358
278 287
258 352
334 104
768 296
547 325
486 626
276 271
465 865
585 268
119 763
506 354
847 280
1035 816
267 97
883 271
279 497
299 814
305 289
1017 479
444 858
336 101
258 1163
283 1262
348 351
272 635
699 365
1182 102
720 101
326 310
404 121
283 475
276 320
275 624
107 296
282 677
67 301
547 430
105 317
279 268
1173 479
294 280
1116 264
270 432
682 261
1209 115
269 294
279 628
455 318
111 865
460 264
291 524
625 1229
105 385
1079 550
294 392
788 318
717 387
364 121
455 296
276 902
294 758
794 289
277 677
324 779
279 498
883 120
264 753
646 107
266 112
109 280
277 855
299 314
283 477
832 301
708 605
326 1211
329 110
928 696
1010 119
295 608
282 500
505 626
282 647
271 108
276 423
32 45
651 280
272 1141
1127 387
277 493
459 312
271 110
279 635
1274 115
34 46
625 111
98 111
547 350
268 115
117 1007
497 121
928 941
418 116
653 1259
553 318
1276 103
287 289
622 289
403 289
260 294
1236 608
68 303
32 542
478 370
361 965
278 325
87 322
748 900
790 316
622 300
260 310
410 358
1270 1003
803 264
258 493
1067 264
726 322
573 325
440 365
416 594
457 115
386 332
262 491
104 121
1254 461
681 115
309 858
276 601
1060 264
483 101
540 107
1121 115
708 308
671 121
575 109
1204 115
279 352
260 1162
1166 322
99 677
1278 393
117 264
105 341
262 930
1227 102
422 781
787 296
729 345
258 405
267 572
259 314
1250 302
1314 303
587 115
267 322
1158 352
976 322
117 108
391 111
1122 1343
110 280
115 112
115 121
84 284
937 930
269 460
742 121
296 115
283 1338
388 1094
708 325
1033 543
271 264
117 115
1193 268
1239 742
294 482
271 119
336 287
724 1005
747 402
291 385
270 306
540 530
1051 322
512 351
259 583
1417 432
269 375
97 118
635 602
426 393
32 75
1171 312
32 364
291 497
331 97
1258 294
388 303
262 310
72 594
1462 111
279 845
269 312
275 111
279 314
272 1301
1130 848
549 325
46 561
713 104
1290 1422
1085 1285
1456 402
108 102
269 293
99 264
447 300
282 287
1157 264
283 735
699 583
1151 290
447 296
382 1300
1002 115
288 271
369 385
274 112
1436 1403
291 117
1099 488
314 1335
268 264
937 608
114 312
259 910
282 493
333 318
671 819
276 940
751 816
528 497
418 370
1406 887
896 264
554 314
1120 900
97 339
697 1225
658 753
812 289
33 561
39 306
452 117
596 115
980 115
551 1434
586 115
833 322
1144 1494
276 845
635 284
617 1077
667 1183
1237 868
1265 760
479 121
525 119
276 1191
272 405
103 303
1075 788
1020 264
1006 423
352 318
334 612
540 104
267 438
283 1148
282 781
1048 268
532 618
301 337
1147 607
637 290
294 264
115 476
282 310
545 1217
630 1005
281 110
105 387
1520 479
341 121
108 289
111 115
1004 264
335 428
260 543
302 289
111 284
459 498
272 493
1450 827
1057 115
303 115
100 115
282 1307
487 624
455 287
895 690
628 121
804 121
682 108
101 101
503 312
298 292
97 605
98 583
794 112
1578 913
356 301
390 115
682 268
797 1143
122 122
711 1078
939 289
839 322
109 301
283 105
514 1012
114 322
553 294
270 566
1114 264
258 1318
1502 308
290 482
371 308
1114 289
109 264
459 108
101 271
512 634
79 104
1053 280
1324 941
951 1049
101 317
79 75
905 387
404 686
283 294
1113 107
1351 121
272 467
283 549
510 101
114 264
1201 264
283 271
1384 115
382 1458
892 290
674 303
391 564
509 497
382 1133
1111 1382
99 308
1002 488
260 273
297 651
331 112
112 104
1547 273
438 103
329 103
1008 121
699 292
296 337
922 302
1291 408
283 296
335 1289
334 1190
269 329
111 108
364 99
418 306
839 770
312 116
117 608
269 428
301 103
260 965
469 318
322 280
996 753
260 428
539 306
585 111
863 280
1654 488
310 280
553 1445
540 264
833 417
600 261
1451 121
382 114
1120 408
372 287
472 264
260 1601
1243 116
391 651
1378 393
272 1470
283 310
302 109
260 443
532 301
586 365
1232 370
282 268
447 460
492 289
547 601
336 117
804 98
109 101
820 120
84 257
115 310
282 1352
283 312
757 105
334 108
1092 99
388 814
1212 1246
1282 121
308 602
729 365
260 1328
105 271
119 108
503 567
276 1428
1650 392
293 385
105 605
100 280
1701 310
122 101
266 872
375 387
1260 1401
1392 310
748 115
630 1261
804 268
1272 605
117 273
267 1723
267 287
277 435
866 112
389 104
587 1497
115 119
573 306
356 668
514 845
278 1673
267 628
597 111
645 776
414 1049
747 779
262 303
422 1735
283 104
290 318
1742 310
98 114
282 1733
743 289
331 318
1593 443
1754 318
336 271
262 1652
323 310
533 110
410 612
1085 341
1611 623
101 564
103 115
66 320
1396 725
302 100
102 796
982 115
582 108
109 289
951 337
1186 115
1089 115
1010 1533
109 98
1092 1452
79 957
597 1240
447 642
926 1028
267 1655
72 105
283 97
424 911
267 1404
283 417
1785 98
1041 1510
273 289
336 628
1649 345
1000 1728
105 120
1097 351
100 101
99 121
275 119
970 289
105 280
1638 668
335 785
905 715
260 1490
305 1439
1024 1321
1703 1715
1467 773
1602 1801
1212 1556
345 108
278 408
371 287
302 264
283 705
837 1656
298 1695
83 530
101 358
339 289
1443 308
532 552
272 916
334 101
319 365
77 1133
267 296
262 268
645 417
793 280
509 543
416 475
105 583
459 114
503 1580
87 1385
547 1569
1781 392
323 264
1620 337
362 1698
387 902
372 306
849 1135
298 1142
436 376
269 273
1416 108
267 686
403 1645
1740 310
267 1150
382 1012
1798 1014
276 1136
278 475
373 537
282 498
415 116
359 1142
455 97
279 430
1344 605
276 684
1479 370
333 457
318 101
356 1028
684 110
622 557
661 121
260 1842
262 557
98 115
771 1677
1536 1183
452 1869
1756 310
1207 735
532 289
63 561
1516 542
375 103
1068 760
1181 511
697 1549
416 111
938 848
1344 345
1864 402
258 880
32 318
282 807
266 1131
326 1292
1136 280
682 1758
452 101
1685 706
101 107
473 112
1245 289
344 389
452 287
1757 399
386 296
116 111
272 273
423 922
671 115
1172 286
849 1867
1508 121
1004 115
671 873
771 1562
98 322
306 111
277 303
336 742
384 289
654 370
541 1604
1770 1618
459 1078
291 1753
894 341
290 779
1205 264
722 274
746 1350
410 1423
1919 1309
32 343
466 116
259 354
302 1595
1191 472
513 1748
604 115
669 121
121 457
279 1896
319 118
959 115
97 292
1041 1187
277 1721
271 358
274 110
317 264
499 1942
276 322
260 815
109 385
1071 308
622 331
282 1794
1420 318
391 616
1440 115
384 1429
282 1199
99 913
446 376
487 104
262 731
465 779
1680 318
410 1190
838 308
288 314
1111 280
729 432
873 807
276 1192
273 121
305 816
276 314
699 550
32 79
575 306
651 101
1054 1917
832 104
1035 322
1827 387
1459 530
424 323
946 264
671 1581
277 770
1026 115
500 98
285 1711
758 115
283 287
382 500
338 306
262 257
65 695
406 686
268 289
282 292
388 351
272 1644
1807 608
117 354
262 696
314 116
278 1918
339 280
346 1907
283 1971
459 268
116 296
684 115
260 1921
1283 101
745 1975
293 777
66 296
276 101
282 294
119 457
391 510
404 657
774 1143
279 657
487 342
297 1136
2031 121
308 116
297 611
111 402
2004 107
302 115
259 102
1498 115
110 677
267 1950
1747 497
371 540
587 430
267 618
1825 1819
1398 317
1572 687
1113 350
745 626
103 698
573 1220
283 329
384 121
111 103
659 115
1099 264
272 301
269 287
1371 1771
794 318
1127 687
283 510
97 308
713 490
277 1574
382 1962
1702 543
1109 115
1485 626
262 284
2071 301
1877 1195
276 634
411 490
276 274
573 294
1970 432
1151 776
707 785
358 322
513 402
671 1424
1071 999
283 940
1616 1304
260 518
335 1621
423 293
697 546
259 922
319 99
2038 2089
1132 289
1686 387
266 109
357 115
293 280
410 116
99 289
1024 109
267 742
604 101
951 1478
1008 1131
294 302
571 1790
270 114
583 109
98 405
1214 1563
291 1641
418 108
935 317
1665 2109
282 358
1736 887
637 460
447 435
1689 320
112 264
32 345
262 423
388 664
649 101
99 318
99 280
406 289
391 287
421 1162
2099 862
68 111
2129 112
410 108
1432 289
283 1661
310 104
272 289
1812 1642
585 312
534 310
1396 332
774 1069
835 317
1342 1093
408 109
291 1306
277 783
335 396
79 102
2140 887
938 109
331 264
1079 292
535 2105
1419 287
1624 115
298 102
1788 302
111 365
607 316
699 1094
794 1768
115 99
410 112
32 385
1815 303
84 300
1443 393
469 289
1586 1093
322 264
1277 121
1187 108
459 111
365 289
356 897
384 296
269 1352
283 1198
273 387
283 460
1277 264
1381 264
843 109
282 1438
111 345
391 2003
371 572
954 110
1868 318
1205 101
72 1195
104 268
406 518
2190 479
1782 308
1932 887
267 876
905 339
1071 1763
832 399
459 2098
849 280
1348 457
83 660
692 1606
372 1358
2157 385
500 844
282 657
799 101
1930 583
1253 112
283 1909
757 611
406 1199
280 116
1376 393
421 104
103 103
440 868
111 261
295 116
287 777
260 467
459 1949
303 318
525 1306
262 428
97 467
1605 540
303 116
599 308
724 497
261 112
1075 358
277 1292
279 318
1006 111
410 99
594 97
539 358
510 104
285 337
2245 301
1097 668
364 115
1130 549
117 112
885 73
697 1588
283 301
283 1150
961 1968
1738 264
1712 115
906 931
101 98
1000 2233
455 294
391 2010
308 120
361 117
277 286
404 1554
74 111
926 612
108 97
305 268
280 393
1883 308
1746 280
279 105
602 264
259 112
1324 696
452 2272
117 98
277 2225
260 280
267 280
282 612
2236 97
267 498
262 819
1859 303
327 402
1466 559
833 435
683 1246
2118 1001
269 302
71 491
600 365
825 572
448 108
67 399
579 115
719 1261
726 293
267 301
258 293
308 1750
371 1816
388 345
597 1670
270 345
1911 1568
2023 2304
459 385
1033 686
1097 868
598 302
820 312
591 101
375 107
1017 493
1247 119
258 841
348 108
1467 116
1113 550
1596 115
116 115
418 673
276 475
387 289
1521 1592
1477 289
1044 289
2207 2176
269 303
1277 101
338 1476
303 121
101 296
307 322
336 607
525 310
492 488
391 121
637 408
450 318
326 101
336 491
371 1776
391 114
1501 289
336 706
285 730
323 115
1298 115
882 393
1976 280
32 39
1370 264
1664 264
281 104
1112 1796
268 97
276 2146
2090 308
1214 327
842 289
926 2137
283 791
2303 121
111 325
942 101
2220 2153
1540 115
329 280
267 294
285 98
336 423
1454 2054
2302 301
2027 308
1171 721
110 312
297 310
1260 337
296 280
2347 287
260 813
276 327
1564 393
739 121
920 461
525 287
2385 423
282 461
260 438
1954 1401
361 101
501 2381
295 531
276 1452
1966 791
547 109
820 325
391 1358
282 312
2080 488
262 442
282 1938
295 399
645 322
1619 430
32 1328
334 306
667 98
592 1612
408 115
112 280
283 684
1075 1150
118 623
697 873
2283 807
2394 287
597 518
1459 721
403 484
336 314
267 408
459 101
1253 318
110 264
277 358
291 2384
298 108
1419 116
282 264
1834 286
302 107
283 902
391 942
361 2242
2386 731
269 500
278 108
105 301
290 97
1286 121
554 2126
450 325
283 308
1741 2174
2120 318
2182 322
637 301
1565 289
282 1928
80 1148
77 121
329 476
1317 264
97 550
258 375
2392 2275
111 268
272 329
969 1148
2096 1937
534 668
1398 345
297 280
459 1529
269 2017
712 289
2431 1717
276 97
2293 402
273 408
2267 879
294 111
722 642
324 103
708 1423
2481 2476
2480 393
2043 121
2469 2419
849 119
1009 1524
1734 115
539 98
1319 488
787 119
1730 350
2076 387
917 684
594 121
326 2445
620 115
699 1034
1239 491
534 2081
297 320
1789 2463
503 1198
347 2016
283 540
2505 779
575 730
301 111
1672 264
489 1990
586 100
573 268
314 100
282 479
279 1668
119 2437
410 103
2131 264
2515 109
269 467
937 731
275 1318
1887 802
926 97
799 122
2113 542
2432 623
336 1351
729 118
361 114
1207 500
382 498
2489 312
1991 115
111 1871
455 264
263 402
899 1198
2502 1093
969 1668
103 480
83 331
335 289
2450 770
587 601
1252 115
729 303
276 457
326 395
1979 99
1671 115
2058 1797
1237 102
642 114
459 316
1336 98
1561 115
404 290
100 308
283 314
112 417
680 608
1558 2231
2333 611
1399 121
371 109
532 2021
348 325
1784 119
282 314
1982 97
487 1385
799 1220
259 118
1892 112
2575 2562
849 365
894 1476
1290 2563
282 651
2147 264
291 540
839 1490
597 1143
302 121
2345 111
260 684
682 302
1605 1539
2398 1217
270 868
503 552
2291 1003
373 2025
445 753
1336 119
1000 2554
114 302
1381 121
272 435
746 451
335 358
297 2210
797 289
283 268
285 107
276 742
1989 108
115 657
514 287
291 770
2404 302
1898 119
467 402
923 626
121 289
312 101
391 442
372 788
2138 280
839 2389
406 2178
298 323
1576 686
899 811
1892 99
117 337
2570 2598
1240 115
1737 115
338 607
2282 1537
637 886
109 2160
100 296
452 2495
2566 112
384 280
2608 785
839 286
514 114
83 116
2252 308
356 770
2637 773
2597 1548
282 1133
2530 552
509 2634
305 518
744 1716
302 430
452 331
1901 1429
1015 310
625 303
1477 2635
112 796
2654 721
262 290
2519 1495
572 264
382 988
277 273
512 1764
267 1814
279 1439
708 1820
294 318
1174 115
1793 115
346 318
1576 542
544 549
267 435
277 807
258 518
336 497
640 115
259 2008
312 115
2464 530
703 108
2497 549
729 814
276 1537
1193 385
260 493
2136 488
1686 1964
1787 264
298 432
2232 476
503 802
1348 120
504 46
1166 264
611 264
525 264
473 331
100 777
327 112
283 286
699 1285
107 268
2175 292
293 2559
258 2373
1172 897
1947 1951
610 572
299 1142
39 100
1746 1135
804 103
571 686
2425 2194
298 345
541 107
585 286
117 873
1920 289
452 417
423 103
610 320
280 97
65 271
87 763
537 1123
2716 1955
267 1562
440 323
2092 1622
262 942
348 651
272 460
272 290
260 2458
2449 1670
2723 310
1651 97
2143 1047
108 493
260 1640
1033 2617
371 325
1589 115
361 97
282 2707
1579 264
615 101
575 1816
361 108
1180 115
459 375
2122 2729
336 2228
445 457
285 121
547 550
32 461
108 848
268 677
121 109
108 1661
2610 102
2642 510
84 763
591 102
408 107
1997 1497
270 2051
540 289
32 367
1348 753
2163 1123
2320 115
503 651
534 1445
32 85
722 811
1000 493
1887 341
2229 115
512 103
622 301
2733 1833
1207 510
2189 280
258 549
440 402
103 1764
117 408
697 115
276 651
32 90
2529 549
573 1951
102 479
335 293
371 2792
327 102
276 510
326 2741
512 109
667 112
299 109
1789 1763
87 104
272 292
2241 1767
275 86
774 100
2112 944
665 115
546 121
665 858
283 352
335 506
751 103
361 2535
99 1192
382 1428
404 2064
78 322
489 2316
926 331
122 264
2216 1996
267 497
279 2573
258 611
2123 112
388 1750
1030 2799
539 287
818 2040
1330 289
513 1146
388 1839
277 2616
1510 289
2376 119
105 118
336 1637
267 862
270 1533
294 1309
575 261
839 552
2063 2822
959 310
1906 289
2774 423
2427 1545
2005 264
622 1767
270 261
267 1438
422 99
1854 121
2211 435
633 399
272 294
372 1900
722 417
806 280
83 2652
104 97
270 678
1043 2035
2835 2434
2059 109
266 940
364 868
1852 1524
294 289
522 2662
789 1135
1112 1495
746 657
2024 387
2860 1304
2029 1545
291 287
460 105
951 2100
971 467
600 1220
366 2541
1684 408
97 102
854 289
1043 328
950 264
1172 552
2782 690
1088 115
445 602
455 306
346 337
382 1404
280 352
610 1618
836 111
382 287
282 1392
361 841
1207 776
272 2724
297 2891
990 101
2888 623
1051 2905
780 115
279 611
1979 1633
333 2055
1060 289
849 323
258 385
617 115
722 2317
1999 115
406 1928
2746 2271
479 116
514 1199
2928 2037
283 931
266 438
258 2903
1272 408
572 318
707 287
1516 1529
509 271
2937 855
310 101
1693 753
485 329
2550 999
1111 364
875 280
269 1192
283 2525
2931 104
512 358
867 623
726 1716
926 308
1158 103
45 2250
2204 488
539 402
280 112
105 2012
267 663
595 365
1226 549
1147 280
272 902
279 329
279 731
2820 807
573 317
32 264
1411 115
803 115
2015 900
272 1306
1736 287
2319 1554
2761 2161
2910 791
259 119
1097 814
333 663
1674 115
2274 331
2980 2223
301 698
2805 303
903 115
2744 2698
2809 111
513 1424
337 846
746 329
268 1312
105 611
2807 1321
795 318
1982 549
1028 257
1000 552
513 100
2134 636
974 941
645 1563
1466 1131
302 777
708 402
2941 2106
259 986
1172 417
372 2513
32 962
729 100
2756 115
391 435
691 289
423 777
2558 112
111 312
361 460
1048 112
259 546
1693 661
364 112
282 508
835 287
105 2751
2974 385
267 1937
875 393
2423 296
3019 1192
283 739
1572 387
2946 97
2748 760
1944 566
610 1539
598 428
757 2337
410 102
2962 731
115 2875
421 550
2886 668
833 1577
2843 844
717 2956
3044 460
3045 287
2626 1983
279 2161
1023 3023
336 352
707 101
489 493
1859 1568
1492 273
3054 287
532 3041
2494 488
258 467
794 98
527 115
526 289
539 1796
2885 1001
335 1554
744 268
2753 811
334 788
72 3020
103 121
467 264
100 284
282 988
271 306
264 1304
1023 1435
97 119
2759 1246
101 3002
3058 1556
597 886
272 1938
1112 661
283 1438
32 1613
2734 264
1531 264
2517 2156
3075 2793
625 634
2613 364
108 742
2378 97
1341 115
1464 264
3083 110
324 1776
3096 3073
732 115
2395 488
1444 115
373 107
295 2244
2158 1309
277 322
268 408
2297 115
622 101
1647 99
3108 292
969 2939
114 286
970 365
337 264
300 264
1782 284
410 2164
2258 264
893 280
1616 387
1492 677
1858 310
656 2187
336 845
258 1983
2596 944
329 3105
1651 2055
411 542
582 114
513 1569
87 594
110 97
707 301
3133 320
112 308
460 97
270 1007
2276 3127
1582 310
258 776
258 1392
258 1710
2321 345
1994 944
440 358
291 375
3048 1123
1813 115
267 2638
774 3126
1534 102
3151 940
899 322
2185 1163
532 2721
2967 777
391 497
883 280
320 104
340 102
1095 280
2899 121
104 942
258 836
503 286
804 341
866 546
1265 325
2435 479
667 2284
2641 294
712 115
780 289
1153 115
1013 111
540 280
1466 760
1954 3113
2442 583
276 497
1640 944
2375 3074
2834 1012
512 301
860 351
1647 626
418 2263
2932 583
1109 264
257 358
72 1606
722 286
2648 549
761 393
1144 506
3158 337
298 2627
3112 408
1000 2021
268 1012
386 2763
750 264
262 2181
77 101
1741 402
804 1495
385 758
2000 364
3097 97
597 2982
1499 121
102 97
335 816
361 310
860 730
1144 1577
950 289
644 289
258 572
3169 807
66 101
492 115
76 1211
676 1612
287 430
276 352
285 119
1266 2516
366 488
450 294
1582 1198
3139 273
440 1839
2226 102
109 310
97 1588
1092 2988
1985 287
1958 264
1492 457
107 110
467 289
625 1574
334 310
1278 2762
711 115
1911 303
2343 117
2443 3235
1997 548
597 314
885 975
260 292
1947 317
433 3091
1480 387
818 115
294 530
1815 657
972 345
860 1478
810 393
1532 115
106 887
117 100
729 115
573 365
969 101
1994 705
1472 115
729 308
291 500
2281 1003
105 1644
722 739
1061 108
276 1001
573 1350
3266 615
3279 273
3280 111
291 2288
571 2269
1492 292
1023 108
3275 310
276 635
272 2263
1213 115
297 3269
364 303
771 1814
597 2288
32 1529
2215 542
1266 1592
369 115
637 549
3298 119
751 1684
3300 623
1006 3078
3283 3114
1586 1077
3284 773
1124 115
3276 99
3248 1123
3288 1833
119 1382
1336 1220
3241 552
276 331
382 121
3307 2508
1159 488
121 408
283 2370
1854 549
1164 684
290 758
1747 312
485 2172
3231 758
3034 2743
2063 2156
373 1008
440 306
3328 942
3329 510
284 264
514 506
1117 393
1480 583
270 341
276 1977
455 408
279 1141
1023 3312
336 294
32 289
3341 1622
3342 1304
2068 264
338 108
1297 115
1420 312
905 2416
3320 686
269 2008
280 430
2195 264
1464 115
2536 115
2601 264
283 292
440 3317
44 561
850 337
2560 770
2258 721
334 318
732 289
391 498
116 394
1090 115
2417 264
577 393
861 115
422 120
272 807
2873 1707
3014 1135
2165 101
2244 497
1312 115
1270 770
3359 2033
348 3212
3102 549
667 337
475 104
258 830
3259 385
1112 1549
358 111
751 99
1910 913
1154 289
1017 1289
97 1007
258 964
1658 287
3393 327
1680 101
750 308
3370 1003
789 542
406 3394
291 302
1700 2478
2123 605
1898 408
3403 623
749 583
459 594
422 103
71 111
272 684
573 408
440 103
276 830
3412 472
2134 3405
1243 1093
276 1606
1028 913
905 700
885 891
260 2764
1348 108
258 988
3313 2726
866 873
305 2035
3244 308
1550 408
623 318
3420 3421
625 301
103 117
45 99
269 3428
2310 770
2318 264
292 116
3400 3136
305 1103
1112 1076
1398 814
459 785
266 802
1048 1811
2612 1797
1480 430
391 1289
2108 2430
1260 116
410 2025
446 46
341 607
832 108
828 121
2568 1800
2270 550
266 114
1450 103
309 111
1591 289
613 393
260 303
45 97
587 112
1187 100
99 320
549 102
534 109
2461 110
269 286
1092 1192
2725 101
333 310
2390 264
2813 3200
1624 112
2582 2121
99 117
3287 3464
637 807
105 339
1529 1633
1536 2284
1988 115
2520 430
112 293
276 467
1184 98
697 112
2706 264
744 1141
282 290
1187 97
1963 289
335 542
3343 115
410 2609
1693 3485
438 698
258 1217
2200 796
600 119
391 807
2000 294
1253 323
281 476
459 1301
108 327
276 886
534 408
2041 337
1372 116
1454 300
729 1717
885 1021
586 308
514 3015
2810 1642
403 345
3438 121
2306 393
1323 121
1336 1711
272 271
932 393
3416 408
541 109
600 98
280 121
3463 310
372 408
2339 115
547 100
269 2702
336 3144
32 434
348 287
72 322
3252 561
267 886
450 408
722 3159
262 902
849 651
794 614
499 2561
1813 393
2501 115
1868 264
273 392
1041 103
45 121
275 2336
2314 770
1359 289
503 500
751 118
1564 944
514 2064
267 739
576 115
479 318
1180 289
3550 642
514 1438
2044 289
994 128
492 1707
462 3039
1532 289
268 318
2221 289
3324 770
3051 350
495 3163
833 101
1216 110
653 1707
1784 308
1582 320
1043 264
719 1005
352 99
45 2369
99 284
597 2773
3383 308
2076 3013
336 1001
3432 845
118 542
260 316
597 2770
2053 101
2138 705
707 1581
866 978
720 1195
102 731
260 735
3555 1424
391 2460
98 944
1399 289
79 119
3563 289
3513 110
1051 367
1788 684
3551 841
267 3481
2514 114
297 1946
671 108
2215 1038
414 103
3615 611
479 913
831 289
269 616
3462 293
3487 1419
3621 1545
3579 280
296 626
2175 341
295 110
1147 358
276 392
1253 1658
336 1312
277 1637
3424 758
1444 310
597 287
3478 791
105 661
3451 280
1787 1001
3611 3375
689 488
487 460
804 865
117 678
3029 2705
382 1199
3267 500
3238 1190
1647 3431
692 594
3340 811
2216 758
279 816
1464 289
1255 115
489 946
2041 1478
1117 280
272 721
336 2629
667 261
300 105
1023 1289
283 2336
285 108
969 294
2194 111
3649 329
2059 873
1227 109
840 121
573 3492
1420 101
1243 1077
589 114
707 2012
1602 118
3530 1642
262 807
282 819
297 3258
3456 110
1072 110
3682 1078
386 1800
906 294
424 294
3676 2106
538 115
628 264
905 273
301 115
103 296
1373 289
116 105
283 264
302 668
2428 264
1729 2110
1730 844
1572 2328
452 310
410 337
258 296
2607 308
2301 318
3523 873
1237 814
2319 3617
2800 289
2239 1328
1732 2205
1006 721
336 417
97 872
2780 110
2683 591
1173 110
3214 1424
747 323
2906 749
2264 2816
2677 310
2387 550
3685 1304
391 1990
842 115
2198 488
3387 274
1323 3465
836 385
751 280
3468 364
3716 2765
111 1225
2818 1719
509 2218
1258 770
2343 811
71 721
333 3714
305 3466
282 286
2574 1946
728 2325
271 296
2000 2248
260 308
373 116
3667 385
2433 358
1810 115
276 1637
3116 811
257 116
586 873
268 337
2916 635
304 858
267 385
260 385
282 3291
276 3733
3516 280
382 3661
276 531
314 303
291 836
335 3666
3381 488
2378 540
279 438
97 122
1901 280
572 3754
3774 3694
2285 289
3444 1633
2411 3696
514 2369
335 2802
2514 635
295 104
3743 1123
307 3225
292 289
2350 687
371 3382
117 261
2396 948
724 1261
500 1321
2574 111
459 3775
1784 293
83 1577
445 2681
104 491
301 1049
3781 2164
3799 1621
2391 488
290 107
671 306
1254 634
77 636
73 102
3556 1003
1406 1684
843 3590
3755 1524
1219 115
833 2769
3593 303
1619 584
105 111
693 280
411 2259
3817 616
294 115
637 428
2096 2478
1023 3584
3822 1768
3823 1123
1665 118
297 2614
283 375
305 3643
2141 289
302 1123
2375 3264
503 2842
1116 289
671 3436
3164 3135
2918 830
1158 1595
1330 280
117 1871
382 460
744 942
117 318
843 3830
1531 289
2387 350
101 102
885 933
622 2181
597 3839
439 112
391 320
757 686
1930 3602
2112 308
833 3181
2409 289
287 2444
283 657
3858 1651
336 564
296 430
2737 392
2443 479
3863 510
3864 482
1480 687
1171 634
2426 1622
1669 115
3232 721
942 115
991 763
327 2121
2180 2658
3757 121
104 2160
112 287
2794 490
361 1161
89 286
2315 2110
2374 409
3882 2279
3082 280
97 350
751 1811
1075 294
2165 1240
410 3846
291 3876
341 2033
291 314
455 3877
3407 364
614 286
3629 308
116 482
510 457
111 101
301 479
277 264
1214 2259
3902 423
2102 1001
513 2775
724 458
1730 1335
1097 730
2166 104
1432 115
483 318
282 460
815 116
1181 365
2474 922
275 264
929 110
1043 117
512 3898
387 3900
3768 2127
283 302
3613 98
2428 788
1041 572
391 1470
335 3636
2474 98
3915 1435
878 561
1555 2444
1041 3895
117 978
285 3897
105 868
534 3920
283 742
3921 1558
2327 1078
1795 264
259 3190
260 3791
105 1094
260 3891
1418 115
917 2017
1563 121
650 561
101 1150
733 561
283 2614
258 3933
489 921
267 310
1054 289
1205 289
3634 1771
514 1439
260 2212
3909 1435
1041 913
3886 1621
1425 370
610 684
3928 268
103 108
257 475
3107 1292
1420 1811
1689 116
645 268
651 97
3648 268
382 286
2636 3598
1023 2561
271 99
1664 289
319 402
388 122
336 3391
283 668
1033 1790
305 1949
1048 873
3137 308
120 121
2350 387
2806 318
280 1123
262 289
586 1007
2143 2212
1412 2658
391 2081
338 310
539 564
1935 479
2023 3785
32 3766
3840 549
3491 3990
487 374
418 271
285 1874
2433 116
582 1622
1593 2508
797 1640
3977 105
2111 264
4005 280
279 677
4013 2218
2296 1495
1174 121
276 1767
410 1968
2435 408
1115 264
1823 122
514 3745
808 115
803 308
3717 310
1071 4010
1697 121
388 868
1579 302
3966 1198
3914 1819
2120 101
3862 1592
32 280
1147 2892
849 1900
2168 370
2240 100
532 1435
682 365
408 264
1112 999
1412 614
3980 457
335 294
745 4030
4046 318
916 1719
1357 115
597 1545
3043 430
1454 294
447 677
3747 846
118 3321
3922 387
1935 1909
1234 1707
1582 2033
334 607
279 841
1247 2695
361 375
300 112
774 1717
534 540
2448 296
277 628
1286 1001
319 102
539 100
3356 312
703 779
1834 289
600 3788
4075 430
906 635
2185 1710
651 705
1174 705
1506 393
797 3798
115 318
108 280
2224 101
307 3861
68 358
391 548
528 1261
262 1710
2859 121
3253 317
461 101
637 316
3937 97
1048 345
267 3943
276 1382
579 1077
459 841
2660 913
717 115
899 3947
671 1588
722 510
77 749
2951 4055
410 4093
121 101
103 110
1111 705
1074 289
725 261
831 264
1370 289
2092 108
3944 303
3731 3069
885 520
467 98
1226 3967
104 647
2930 264
4105 1385
969 3972
1272 788
375 101
1253 2352
299 306
109 296
510 1435
3138 1047
410 1187
2148 115
326 616
3979 922
443 734
852 289
264 121
295 109
3251 112
1683 2415
573 98
1584 310
636 105
1645 121
1173 3772
771 472
682 308
372 911
315 271
1275 393
290 303
1693 100
4143 119
269 320
421 409
4157 3111
406 2054
4094 302
1576 731
110 493
262 2316
279 642
745 102
1455 2016
534 294
1023 1633
3345 482
707 1900
283 273
728 116
283 358
2029 4120
279 721
283 2934
299 1476
576 1423
1536 337
259 120
3184 264
708 999
1043 111
122 1220
707 612
745 1698
306 549
1689 280
1985 114
292 310
743 296
1247 99
4192 940
1480 601
3350 280
1112 98
259 280
4180 101
757 287
1043 1558
547 1008
4133 4110
1732 115
375 2848
2560 2669
2869 1225
2029 668
266 4190
1265 550
3348 392
4210 111
363 110
105 1820
335 438
4197 510
4215 108
969 1300
1134 844
1015 1309
554 4146
3050 112
4057 721
887 264
667 1874
277 293
1023 4206
1214 942
460 115
4043 897
885 1091
3566 156
4021 280
2602 731
2085 97
467 387
258 4145
319 2609
3820 111
1048 292
1116 115
644 115
833 651
277 316
2310 1548
258 320
304 387
1682 115
405 1195
2436 264
3334 115
3076 115
283 807
3918 760
272 117
4070 668
682 605
1020 289
267 467
258 2279
1341 900
372 1306
1041 3477
832 287
2226 480
77 1458
2806 101
74 300
940 479
276 594
637 4248
391 796
333 612
119 2337
447 117
109 109
285 922
4276 4131
1330 557
365 479
336 284
3779 264
1531 430
102 664
4283 101
3009 611
586 402
4286 500
269 3480
282 1458
331 844
4272 116
3322 111
3971 350
326 965
418 98
1023 591
4296 1684
2221 121
649 364
1702 116
258 651
1944 611
1017 286
1935 3207
1624 837
283 322
3960 749
4307 4279
1311 280
487 763
267 4048
3452 660
114 493
285 788
1071 108
410 317
1547 566
81 117
32 329
4319 3507
2569 115
1986 289
262 1641
479 280
2090 999
635 978
573 4284
2128 3071
283 1240
2166 1135
302 848
365 2629
4108 280
1272 331
1460 115
1000 524
4302 329
280 99
387 549
849 1839
1605 273
1685 2223
287 105
4288 111
961 102
1636 2705
333 1470
2844 408
266 318
610 524
375 97
4199 1335
2239 107
1214 2957
365 352
422 387
324 114
3646 101
459 314
335 696
2602 3815
860 122
597 472
637 611
2794 913
572 103
1834 735
1936 115
473 4338
3285 946
582 1103
283 4079
82 101
371 3549
787 4139
2231 668
74 417
1043 101
503 4251
282 1150
597 4290
1877 408
503 2279
3539 2110
275 114
3544 472
115 289
2952 811
2041 2100
905 1007
1828 482
258 3689
1172 322
4245 302
1234 4376
4356 302
637 105
284 540
77 1300
1144 1539
4200 549
951 2127
388 101
283 408
4337 770
3792 99
1059 115
614 785
538 289
285 4355
2528 264
3982 115
4085 345
77 500
301 121
3954 4273
2122 104
4417 479
3226 1758
282 438
295 358
929 280
2296 2990
278 2701
610 1580
512 1539
1201 115
260 3756
560 387
4140 342
1651 268
4359 273
340 561
3773 3274
270 814
272 611
1709 115
969 2683
371 2221
597 4235
726 2957
4441 121
1953 115
4404 785
2338 1612
326 628
293 318
111 779
2996 264
72 101
410 345
1079 1719
541 289
520 114
610 491
1898 607
298 1435
682 341
839 268
284 318
671 430
4362 302
267 781
272 862
4464 273
4465 530
280 111
4178 1338
276 564
1253 605
385 115
4165 2765
2503 1524
4446 332
3401 318
2068 115
2217 318
1319 115
2605 387
1824 102
1757 3331
2296 807
2282 430
1604 105
746 735
1151 4398
1454 770
2927 758
4488 1012
319 107
276 916
4491 107
267 268
832 294
4366 549
1048 1350
509 721
1147 4113
1336 873
114 303
4484 2848
279 4489
1687 2995
1158 116
3009 364
2232 490
1531 280
2285 115
65 261
2517 706
2712 289
1579 289
2376 493
602 1833
3467 4331
1586 116
447 3351
3575 788
3037 271
668 393
708 323
4521 1195
2607 999
450 1476
4147 807
110 549
722 548
371 1321
335 312
2951 1638
4530 497
272 618
1522 115
335 435
1768 4204
587 289
388 112
692 635
4538 100
1534 115
268 550
2154 2695
2211 1307
105 98
115 273
1437 289
410 615
348 323
744 2010
277 3176
637 1668
1381 115
1498 387
622 1883
97 922
333 1574
2043 332
637 310
1981 4187
1718 393
2200 4448
411 101
273 318
610 848
1266 4408
298 814
1581 115
3153 289
789 280
97 273
406 286
582 111
72 97
2189 2271
3893 770
4155 2259
2795 116
4551 268
4578 3857
4553 1240
297 1312
2326 549
1516 2701
1749 115
2348 4064
452 3236
969 3624
1465 364
893 393
2935 108
2788 115
513 1811
2252 999
282 296
1051 2361
2995 108
326 1577
348 292
659 557
2486 264
682 350
1944 686
2427 301
2953 115
4410 387
2117 264
304 561
3268 898
2892 664
372 607
512 287
4611 354
110 1049
501 101
366 280
1586 2325
4315 703
1043 4596
1649 432
551 916
2086 393
610 1451
260 911
1140 264
262 799
1170 1008
1459 264
1043 97
3892 4609
2314 3376
620 1220
1082 115
4436 4348
304 836
4216 897
2348 735
267 352
2077 115
66 4109
4617 100
3090 430
920 2187
804 2051
77 4275
3129 1318
1250 1548
3486 944
1282 115
391 1307
340 115
66 4137
1932 1568
452 438
3470 115
729 868
1825 114
825 4501
4625 457
1756 1142
1947 355
3664 3935
839 460
282 510
1029 1404
554 815
4665 310
1518 257
291 97
291 635
2479 264
364 3528
1144 101
1591 944
310 121
2348 3498
99 1307
1741 542
885 962
720 873
263 1292
1489 115
269 4460
2548 2205
963 540
3802 705
3681 3386
110 1195
282 405
1546 280
2321 432
4390 280
1789 841
276 4671
270 1764
269 721
1532 296
3927 303
79 107
4659 1008
4141 289
335 322
108 322
99 2127
757 273
489 312
275 2361
565 2250
4577 472
334 3691
4378 370
2453 930
4667 1476
713 409
4713 280
1042 785
2276 475
2402 264
2725 482
103 318
479 289
336 1123
2870 264
671 601
282 2178
924 1077
918 393
290 289
283 423
447 1753
365 705
2543 289
672 758
348 4703
1966 4685
820 103
267 308
4034 3176
3178 264
2846 264
283 467
4009 1557
99 886
97 98
2411 1814
335 1385
260 942
276 1123
2423 1429
346 758
3237 264
597 405
4751 296
768 280
3042 2828
110 848
2452 115
850 268
2660 3071
799 318
625 1451
4760 293
2024 1964
1157 289
2737 490
585 510
45 742
1502 999
1492 121
903 289
2185 314
423 698
283 1001
2159 3797
4193 308
1564 308
1102 110
455 540
115 1977
290 490
277 2210
4418 308
804 3571
295 1428
514 442
926 886
2264 1588
2281 345
2209 115
2596 1557
46 46
356 2669
757 417
2461 97
1010 268
87 4570
1779 115
1114 3730
832 2269
1856 115
2399 264
283 4073
118 310
2796 3899
262 2370
3825 428
980 4742
503 2769
1702 322
3374 294
860 292
726 542
4397 4431
3511 944
283 796
3042 1719
2117 758
272 1539
459 796
905 98
326 274
651 264
4385 811
277 394
860 696
2092 271
45 402
4826 1900
84 111
3037 114
4829 2373
4830 2106
2158 4674
3992 268
2401 115
514 3873
2026 3637
2411 442
4571 788
3216 2828
1071 635
1051 320
4841 773
4817 758
1372 1077
32 4318
356 4268
2200 393
922 758
622 1637
1847 115
447 3236
295 1161
279 3242
4669 2127
492 280
68 293
4406 3386
272 320
4858 530
3475 506
540 99
825 1001
1008 109
4059 101
3925 1434
259 4339
386 1429
334 2051
3812 264
744 4228
4262 602
3564 264
4116 3265
989 289
447 331
1652 399
3847 561
610 651
509 4313
283 2146
3226 98
489 552
3662 4778
768 2726
3043 1537
3167 944
285 292
4237 264
309 1874
382 4495
404 942
4528 3692
707 3417
296 402
782 115
993 115
3559 264
4188 408
4745 4863
3887 257
1115 115
3669 1199
4902 758
318 428
637 1028
2158 4343
539 312
4753 1312
437 110
575 612
2059 98
1051 312
4104 289
2998 264
1112 873
278 4545
2108 900
1658 318
110 331
2918 97
1214 329
366 115
1157 115
279 1229
3216 1719
3827 731
290 913
2268 289
735 121
1297 264
279 1641
39 345
2264 4567
3875 264
348 564
459 548
336 635
4628 1052
282 3207
719 1131
259 320
2241 284
4942 109
4943 316
272 308
115 490
267 375
2374 257
309 98
4026 770
534 2172
2291 121
836 1045
1436 811
804 1094
3021 264
1558 1977
267 4904
4931 289
108 293
371 837
32 86
4728 941
39 46
2555 289
2402 280
445 312
4798 1710
1007 479
105 432
4316 402
326 799
455 572
4973 1141
3626 322
2166 280
282 1198
774 4919
108 1800
279 1710
291 841
4077 345
1125 317
540 112
854 115
708 4960
4986 286
4264 264
563 376
420 115
1663 119
4991 2770
512 788
4905 1312
4819 458
260 4759
899 2187
382 518
326 4351
726 942
271 678
1564 999
2253 479
2865 115
1850 115
2613 2248
335 642
272 264
388 2352
867 292
315 484
117 387
108 115
349 116
447 2228
661 944
1827 3949
563 46
2117 289
287 109
1880 289
3628 1537
1023 686
597 300
5024 4687
1410 280
2085 430
348 2352
682 836
2700 807
1658 117
3171 687
4861 268
645 491
99 2174
5035 105
2276 4500
1071 841
1584 2430
1809 115
5014 2585
302 408
66 965
1201 289
446 44
97 104
267 460
4776 337
509 5020
452 1946
1112 4084
291 2764
433 110
382 294
83 112
277 5031
272 5033
102 964
1174 280
1085 5036
4984 1078
3511 308
1317 289
640 3069
269 770
1206 318
2927 2585
3740 264
4267 370
1234 264
77 988
412 32
544 99
5073 1001
2027 1557
1048 4969
1935 612
271 294
447 101
1243 482
1234 442
260 314
2024 116
5083 931
582 635
2226 5001
4892 1797
386 2991
1795 115
2091 1656
114 289
775 264
926 5061
3171 387
2881 264
1703 284
2189 308
2916 2990
553 1776
4280 612
683 858
102 121
455 119
2810 109
1485 3132
4911 302
4218 1537
116 101
1584 318
104 1350
1981 114
3228 115
296 97
1427 115
1640 1001
1813 4979
1250 294
2866 115
1879 115
1986 115
682 4153
832 111
3715 4535
787 121
278 294
112 121
794 5102
382 101
2976 101
1963 758
2122 292
4947 4755
314 97
277 332
122 572
258 438
266 1142
510 115
5096 614
621 2016
454 115
1899 115
73 115
65 108
266 101
2558 2416
732 280
410 1148
281 5108
4736 264
3782 1358
105 500
258 428
1152 109
5154 506
1683 1093
532 557
3728 4771
2350 2328
257 365
418 109
279 506
4752 777
4875 549
3145 264
2390 280
4840 1196
4941 284
514 467
682 4514
4945 97
630 1131
5047 2205
2520 3582
1023 479
5175 1192
66 921
863 611
1140 318
2425 5110
266 467
3787 615
5182 435
534 322
4012 345
267 316
547 402
682 1225
388 323
4066 3070
266 271
291 642
301 3132
473 4555
5168 921
1564 1557
2043 1800
3129 776
744 4213
4637 323
968 114
2964 119
5202 540
5203 392
3662 402
32 1811
358 5152
310 387
482 1131
1188 115
3331 286
410 3417
1981 108
2108 100
34 44
4457 1001
707 1135
4087 753
3702 4970
4519 1549
4254 364
3702 721
32 89
1672 115
3137 999
305 1994
4306 1717
885 1177
4921 5135
78 312
336 5207
309 115
4369 696
3050 341
295 1577
260 5211
5137 811
1925 115
5214 4326
600 293
279 601
799 289
3251 2121
797 1658
2720 264
1944 273
926 2773
87 4876
4459 2430
1258 846
522 1001
600 872
4053 549
2442 301
2154 1592
2407 115
4295 329
5257 1946
866 98
2118 572
4998 1195
331 98
1172 1721
3695 408
4652 1833
1234 289
551 271
682 550
109 781
1099 115
3628 430
2983 548
582 302
1066 705
2520 601
3322 1558
87 460
3987 3692
2626 4821
2274 1012
1322 98
5206 4802
899 111
1737 264
405 322
2550 1435
410 308
1342 115
1966 111
272 791
1858 115
4770 289
5244 705
637 5067
1053 264
1193 472
1361 290
2301 289
382 965
899 2172
1035 1301
4547 611
3254 289
585 428
1740 308
459 273
4189 290
1298 1557
4978 385
4202 1047
372 493
3095 115
108 296
1061 3561
264 110
5315 318
5316 1131
307 634
372 651
1420 1820
2251 561
1250 2877
3965 310
391 312
33 39
295 530
1205 318
314 5126
2037 318
1004 289
452 2317
1963 791
768 268
5054 116
4977 1001
285 3819
277 5115
1480 2328
291 472
372 2458
281 490
972 308
487 5317
2568 105
5344 705
597 442
3134 115
284 289
1985 5328
269 5329
835 1358
260 300
1193 635
774 4918
1066 115
757 799
382 5133
285 5278
5283 868
1308 289
5056 1001
540 318
2408 497
103 289
4537 115
924 115
1020 115
610 294
1006 491
105 296
5346 115
2115 115
1028 318
5194 393
3501 121
1582 4415
740 1025
5377 264
833 1580
447 301
4357 777
114 114
276 1307
1277 318
297 497
117 289
2602 4927
745 114
5388 696
279 385
961 318
267 1658
390 289
117 1796
111 432
4173 100
2253 4676
3345 868
860 2100
74 460
348 1358
334 2153
724 3365
1624 99
1227 465
277 887
5406 530
2326 101
326 1574
1347 4298
447 4127
4367 999
2281 432
797 815
5414 1018
1679 115
109 583
2111 289
1398 351
4263 108
83 104
276 834
118 97
885 1059
5246 1312
5375 280
348 788
3842 1131
277 117
5429 120
5430 117
346 3310
5174 897
556 1612
362 4332
2688 115
3475 564
121 308
3664 721
720 121
1416 264
1214 1716
637 1524
1635 115
5281 438
1272 364
112 101
889 2541
5057 1548
1266 4130
471 97
1336 1549
790 116
3527 364
885 1287
307 97
1650 5160
418 110
928 1748
728 1077
275 5428
885 1363
5404 1003
276 408
2163 264
89 628
5405 1695
100 111
1738 115
586 2816
361 2137
5260 705
335 572
4845 417
326 5113
4299 264
2314 1548
1823 1719
4421 393
5287 1670
2933 289
276 1983
285 294
105 107
317 115
4451 4041
726 300
3488 292
334 301
371 1007
899 2638
5352 3135
267 506
283 848
4052 549
294 387
2529 848
969 114
45 3111
4975 121
1637 327
336 1358
514 2702
270 3571
2321 320
4765 2271
106 331
818 393
334 294
260 105
361 802
920 1677
4939 264
358 264
2461 101
5487 121
2940 289
3660 5269
348 3885
1099 289
258 300
2989 115
969 3734
5490 796
3715 1633
661 549
32 120
4634 115
2845 115
382 364
864 101
391 5501
1214 4467
2800 318
1054 264
2158 280
334 103
553 5417
282 1601
4498 264
972 5313
4510 1093
2204 289
1168 4957
3167 308
473 273
45 98
5510 1343
2813 1135
485 322
279 964
1858 705
297 4324
1113 385
2261 115
101 264
5431 430
4096 944
1384 296
285 978
1970 102
3467 2585
1697 402
279 331
3913 4520
319 387
1828 900
577 2040
5319 303
371 615
1576 4779
1829 2205
1751 115
260 557
326 2525
1640 999
1043 921
307 3734
272 5208
266 4162
850 261
102 273
3285 1990
2215 4720
5263 121
4039 913
1266 102
3374 1548
1807 115
2091 289
5422 1003
79 5012
5456 1225
598 3321
3612 115
97 999
929 705
4066 3242
4154 964
110 3949
849 602
4096 306
5560 121
920 472
1501 557
5353 108
2900 289
5333 758
299 4613
1006 2361
418 1871
578 111
1276 2176
456 5582
5505 758
560 103
5507 540
1787 289
267 327
620 261
5620 286
489 508
3109 115
889 5600
554 98
5625 3582
71 423
2108 110
1316 2040
267 776
860 941
1280 561
263 910
5633 531
5634 280
610 2842
4345 1715
4052 121
5055 312
410 115
2398 490
115 303
277 3570
4603 1478
500 583
283 734
797 3181
258 942
3608 3797
5195 791
5169 601
2902 121
440 814
1010 2051
797 628
105 355
4373 855
940 280
5150 289
1348 294
97 290
262 2802
944 777
5390 657
4189 657
4039 476
500 1874
346 1996
3827 930
2085 364
258 367
5671 530
382 5042
87 374
671 2701
2166 1710
5493 393
83 531
560 1049
551 111
1935 1196
1958 289
461 121
1340 289
3752 289
1048 605
4668 2828
712 5663
291 1677
3507 550
789 4324
1075 2460
5010 848
333 500
1582 308
896 289
4539 2627
1227 687
1207 4541
3347 289
5161 364
4656 3913
3120 264
745 2743
1672 2164
3082 289
2310 1312
2844 1977
267 1721
99 99
2134 5565
974 2212
1639 289
585 4127
3728 3013
743 115
4594 117
2027 944
4274 1190
2224 510
3430 626
326 117
1336 1874
3939 115
707 364
3138 2212
45 5690
1085 284
328 112
89 500
273 848
4622 302
1226 848
4623 115
4373 608
2778 115
989 115
597 5362
107 1350
260 1794
4393 100
1188 3039
2143 5242
5267 3730
352 1001
1636 115
4485 1557
5702 1996
4828 1131
100 289
1265 350
885 1608
5705 1983
573 2012
76 395
907 3310
1260 482
637 2172
98 705
5079 1007
525 940
5099 1557
2605 687
1017 5656
335 1716
361 111
297 1673
3626 5576
336 289
4740 1622
5729 4223
4866 345
3446 289
445 284
1112 268
276 1539
295 615
622 3873
359 1008
3232 758
2112 1557
365 264
2464 3070
5297 5058
65 104
273 1309
1901 887
5462 561
3234 785
547 1537
1828 1422
301 318
539 1358
314 109
46 39
885 1627
3021 289
1043 2535
3669 273
336 902
388 99
1997 350
4768 115
3446 264
264 115
267 2389
459 460
371 493
5547 327
1738 289
361 121
291 308
4230 561
4873 289
2417 289
278 1451
1635 117
633 5348
639 4332
108 557
2811 264
2404 758
1006 114
787 310
260 458
108 3899
839 668
5521 280
625 1300
271 323
4221 318
5801 4894
4825 886
1023 5771
1784 5617
382 303
1500 5209
109 540
4323 944
1283 1077
598 4447
1171 105
4539 815
2426 5091
3646 318
885 1463
1685 530
1591 1557
2200 2762
969 320
920 836
518 121
637 385
5678 1217
3107 294
307 3015
5498 268
532 293
3000 289
2601 289
1265 98
5861 848
5575 549
1985 5826
959 289
2041 1797
2945 115
336 5438
849 102
2497 301
582 364
122 549
2264 4184
610 540
1616 3274
514 423
348 271
1658 944
668 97
5665 5838
292 318
422 110
262 611
329 705
2818 337
385 121
279 287
257 1918
2531 115
1851 115
2759 4730
3051 550
679 4122
1641 121
5851 5759
2453 731
456 5468
121 274
1138 3637
258 121
2436 289
5858 4719
272 5794
5570 942
5904 1955
288 402
2579 115
122 289
3116 1403
1044 115
336 1240
1579 5660
961 110
382 475
539 2681
1454 286
2952 1403
935 3190
4854 121
295 5879
1683 115
258 3498
3575 3885
338 100
5537 268
1417 345
287 1595
1897 115
4012 432
305 1192
276 1655
267 2228
597 294
3566 157
5817 1312
264 5750
1395 289
4174 264
112 686
391 946
447 286
272 1434
420 561
1981 320
788 280
2382 2516
5897 2037
5591 393
1028 921
3000 264
1245 308
540 303
260 4447
110 1025
1254 97
3927 1568
285 540
5957 290
1564 115
99 705
2113 105
1958 280
4202 2212
620 5872
645 647
307 510
326 2573
293 289
2283 3570
969 942
2024 687
3006 705
1276 1719
1371 115
1272 607
286 115
500 385
5776 1800
3992 1350
1679 557
82 4953
4451 408
597 942
726 651
1798 111
2494 264
2846 289
1781 913
67 104
2592 115
473 2869
5991 642
262 293
1941 115
283 389
582 287
3695 2415
3831 115
447 5949
283 2181
1111 2248
3995 115
1066 280
1828 350
326 1404
4295 105
736 549
336 836
5871 1794
1722 318
3539 1955
459 5373
276 623
2449 1445
1212 1008
4306 705
418 2008
5695 1093
2180 289
111 341
5139 731
2834 3857
1576 930
391 1495
3595 115
2085 2248
111 753
5992 264
2811 289
4059 1309
1852 4326
518 264
105 287
100 549
1480 350
3413 115
270 657
1154 1656
276 642
6039 284
2409 115
2053 115
501 561
418 100
4218 430
371 940
1029 498
276 2064
6048 261
6049 287
600 112
2952 5386
2486 289
1055 1545
282 542
361 543
6056 111
4036 115
99 999
604 5364
1730 115
32 891
461 114
257 119
920 5395
5396 944
294 1419
959 264
1480 5745
323 121
2293 799
5812 101
1008 776
359 561
292 1977
308 121
4792 264
4668 1719
1042 1028
718 1612
106 111
1258 1312
372 98
2262 115
645 735
4980 4848
989 280
1984 115
2906 549
671 865
83 257
295 119
1043 3265
6093 111
6094 484
6095 104
282 1292
6097 105
3514 561
4421 549
512 1306
1051 301
4640 264
303 4526
1554 97
6105 364
5914 2869
1521 2110
832 5683
2224 2242
3821 318
439 402
726 1580
3356 318
111 100
860 6063
3330 115
2736 289
1901 4223
1665 3264
885 1210
292 264
262 5936
1760 289
4672 4041
6071 303
1616 1093
4573 1225
273 758
3722 115
111 264
1009 115
69 120
788 121
