# version: 0.1
104 101
32 116
32 97
32 115
110 100
32 119
258 257
101 100
259 261
258 111
32 98
105 110
32 104
262 97
114 101
111 117
32 102
105 116
32 84
32 108
32 99
32 100
101 114
32 257
32 109
32 112
270 115
111 109
32 111
97 121
275 257
97 114
105 115
268 103
105 108
32 103
105 100
32 83
97 116
101 110
32 110
260 97
269 97
97 110
105 109
111 114
111 110
32 274
258 104
32 72
108 108
108 101
32 34
280 114
111 116
101 116
294 257
105 114
306 101
287 121
101 115
101 261
32 268
118 279
117 116
111 119
99 107
32 76
32 117
108 100
32 121
111 111
298 293
105 103
291 121
101 120
32 114
267 101
32 73
97 109
260 116
99 101
107 101
260 257
118 101
112 112
274 104
262 343
79 110
285 110
327 272
285 102
107 264
114 105
324 331
260 111
102 116
110 116
269 289
282 108
97 100
320 121
32 66
278 286
305 295
325 112
356 286
299 100
115 116
101 108
263 121
332 116
281 284
262 101
273 302
32 101
32 77
117 110
272 326
39 115
109 121
276 105
111 353
60 124
318 379
381 368
124 62
383 10
99 104
296 116
299 342
270 354
274 116
260 104
272 116
257 114
278 111
108 121
297 311
284 101
115 101
32 358
272 261
97 307
262 104
301 101
389 308
32 107
258 402
276 403
97 108
263 271
104 116
46 380
32 271
32 65
387 121
260 109
335 116
32 32
267 330
32 289
267 321
97 323
259 110
298 119
350 318
46 34
273 423
114 121
259 115
114 97
297 101
345 101
293 101
97 339
39 116
33 34
117 103
276 328
118 264
370 271
275 301
111 271
345 338
276 111
32 430
101 99
269 301
266 111
292 111
32 74
267 111
260 101
314 108
259 271
32 106
288 100
388 264
291 108
292 451
362 303
263 109
32 391
259 116
117 114
105 261
263 314
102 117
260 112
119 286
414 291
278 293
277 375
275 284
257 110
359 296
299 341
97 268
288 116
257 100
116 279
32 332
114 284
262 386
259 114
105 99
277 300
32 87
108 112
465 108
328 100
63 34
104 290
425 115
297 336
359 321
330 409
259 307
280 486
404 110
117 109
303 101
288 107
267 420
260 286
89 272
273 374
277 108
97 271
297 111
276 101
111 112
439 377
468 264
260 99
492 264
259 108
272 103
442 437
115 431
366 116
281 300
427 349
105 323
266 121
378 339
273 101
273 518
436 349
260 396
482 399
450 101
281 101
336 101
284 312
333 111
267 114
117 271
267 314
103 312
105 338
449 121
262 375
337 476
303 103
195 162
226 130
544 172
115 115
536 100
260 532
273 97
100 100
290 115
259 103
262 302
401 295
357 101
281 432
107 290
373 284
44 34
105 101
322 110
258 271
333 300
537 392
32 503
259 467
97 103
288 264
502 115
541 264
272 100
281 555
277 288
548 490
266 564
274 264
116 392
282 500
277 111
298 100
285 577
429 119
479 99
32 69
282 321
273 480
282 114
101 307
276 97
269 435
98 308
281 117
328 107
97 385
552 475
105 102
269 396
262 472
32 70
292 488
104 295
101 112
401 111
317 116
350 264
273 399
273 108
263 110
277 104
278 444
342 264
270 108
97 115
292 312
113 117
32 68
363 290
515 409
112 108
400 121
260 119
294 117
272 115
110 110
305 551
583 576
378 349
292 311
117 323
114 111
293 264
610 631
267 108
97 341
32 118
277 531
372 358
288 97
347 114
294 336
97 120
512 568
117 365
346 101
393 103
278 561
272 397
110 121
273 463
277 506
334 99
289 116
305 300
524 366
97 112
624 97
278 357
259 98
281 121
436 107
32 339
272 114
262 456
288 110
292 114
261 279
292 428
467 115
317 115
469 110
373 641
282 111
102 101
514 668
446 107
658 391
300 116
98 98
276 311
369 377
522 115
497 101
279 115
289 101
294 111
267 117
294 638
274 101
460 517
562 101
305 618
267 400
281 440
444 105
296 264
99 477
258 97
285 326
412 656
269 111
508 664
271 116
319 116
103 264
485 472
282 117
497 322
589 435
258 432
694 407
466 710
260 302
277 295
550 296
682 119
105 341
306 279
105 97
282 101
421 121
714 394
258 114
353 279
269 322
448 111
97 117
109 97
390 322
268 107
712 426
258 119
592 385
289 104
333 374
97 261
299 261
584 358
260 108
448 420
118 296
269 647
285 114
285 112
260 107
281 111
505 111
260 374
703 111
258 605
319 517
295 101
266 326
270 478
305 289
32 296
300 107
32 596
587 571
498 112
32 615
285 320
257 271
470 110
100 121
292 634
280 454
429 320
98 121
372 594
97 338
533 284
479 619
116 121
372 295
622 721
485 101
311 392
726 397
282 521
105 303
282 702
363 264
103 101
312 478
287 110
453 643
97 107
590 704
292 271
348 102
277 284
270 116
311 104
373 718
449 120
297 538
599 480
117 101
39 109
337 114
651 778
429 264
306 289
291 101
519 121
412 261
273 111
117 99
453 111
334 288
414 400
105 122
118 290
276 542
268 101
103 426
115 264
301 407
302 116
421 818
260 110
515 104
258 426
325 354
291 100
115 366
462 116
824 291
32 67
404 463
701 264
32 301
32 543
442 341
267 784
607 322
277 400
278 303
32 318
259 100
267 604
118 386
89 317
288 115
462 112
357 121
101 109
271 336
97 321
462 110
277 308
118 317
545 197
853 147
454 296
292 855
549 365
277 117
650 487
98 279
307 121
334 849
372 740
112 116
267 428
273 105
105 317
653 349
277 257
708 477
744 121
267 121
453 759
292 108
97 397
276 571
826 102
84 104
268 121
258 101
270 121
119 110
862 105
277 396
308 119
276 652
262 111
883 487
269 454
679 115
333 97
337 456
273 336
820 115
269 827
325 666
444 116
337 286
110 290
276 312
99 116
32 80
267 793
73 116
115 104
257 115
98 101
298 673
328 108
271 101
579 108
731 111
267 357
267 593
832 112
509 308
411 109
300 101
412 115
378 437
107 286
111 323
808 121
612 349
97 365
260 117
845 114
865 341
390 375
304 115
324 923
111 98
289 477
421 816
260 927
893 331
271 546
330 104
719 916
273 885
837 264
78 111
333 264
412 723
337 302
725 104
105 112
352 303
273 268
76 312
108 264
661 864
273 440
102 440
278 300
390 506
273 394
33 380
289 264
550 264
282 483
545 226
393 302
447 290
781 773
558 377
32 71
661 602
297 322
616 357
533 323
851 300
278 428
288 121
840 842
498 377
507 684
743 695
390 879
567 101
772 440
262 463
393 307
277 426
277 303
32 431
334 954
105 264
291 394
411 407
337 111
115 111
87 601
665 399
514 992
308 115
258 850
132 162
962 998
372 121
273 288
986 97
273 114
294 112
507 960
911 302
270 114
116 535
654 290
946 110
325 110
779 264
111 121
301 98
116 104
297 368
612 557
116 490
505 1014
299 115
281 97
305 114
401 804
101 312
267 264
975 535
468 101
359 932
107 317
84 601
286 907
483 264
103 279
878 756
105 623
334 290
278 596
262 114
746 115
273 488
106 1013
292 716
961 1008
305 729
436 557
32 78
278 366
102 102
97 99
722 629
270 274
1000 317
435 409
266 119
411 619
534 111
991 611
116 290
886 296
292 105
259 723
267 271
285 882
635 111
612 107
847 860
887 666
789 295
1004 311
32 82
736 115
390 391
280 357
755 1041
915 819
836 683
372 320
622 101
395 1032
633 798
953 365
678 274
812 264
259 342
314 365
429 288
760 521
278 289
278 101
97 591
1075 677
917 1066
116 264
273 733
307 322
260 399
111 303
738 431
325 115
727 122
1055 988
259 1100
259 99
308 875
553 107
792 385
333 475
728 264
891 1082
285 921
103 300
258 407
768 101
76 331
673 271
678 264
427 107
333 117
1037 1115
530 300
687 104
333 494
266 117
327 101
100 286
792 696
534 494
807 1095
637 499
800 542
87 101
260 615
337 521
325 397
334 296
281 302
1064 538
258 428
279 264
1087 394
295 104
32 662
262 762
327 588
1119 354
609 825
858 350
449 295
110 103
260 535
448 918
651 531
600 1113
549 338
356 770
300 783
269 509
269 938
275 104
259 109
76 593
97 1053
1039 279
337 440
1007 109
393 317
277 114
278 937
374 648
1147 623
281 567
291 97
277 593
334 108
371 103
258 588
549 118
261 727
97 546
272 354
99 111
305 910
725 101
308 602
297 494
743 296
277 432
109 440
280 271
720 1188
633 922
273 1085
274 99
117 307
706 307
289 115
97 696
314 264
419 478
32 122
301 317
302 110
621 1024
282 475
404 293
667 1116
67 300
289 121
335 110
346 394
281 303
508 97
524 307
267 97
985 116
737 499
547 115
873 264
874 357
267 274
298 261
1193 472
404 1222
77 284
275 601
496 264
450 317
866 271
282 279
607 111
337 509
387 695
260 290
667 546
267 1169
1072 264
945 121
324 312
258 350
354 115
278 114
97 314
616 111
411 1197
342 121
334 104
101 121
990 1083
327 976
534 777
276 846
281 498
299 813
587 268
268 115
1177 302
324 1172
39 271
281 669
1256 688
973 119
277 271
411 365
1022 822
292 531
269 295
461 101
276 669
896 365
787 317
352 353
282 506
122 121
305 290
411 620
295 392
411 846
334 1111
119 762
781 318
829 300
553 326
660 115
107 296
445 877
1171 483
465 861
282 655
278 499
1199 102
1021 557
277 321
791 290
278 629
295 279
672 261
1205 115
270 437
401 121
282 480
258 1198
273 630
866 120
365 279
281 647
553 426
111 861
282 476
573 115
337 101
1047 483
492 101
836 279
330 110
471 377
599 268
273 456
87 322
97 1208
1123 385
264 764
504 648
713 385
98 111
325 817
450 296
299 314
697 365
105 386
266 112
1272 1240
271 108
421 777
294 620
700 326
700 611
277 605
105 320
499 121
109 279
393 290
277 909
1191 115
935 684
84 284
276 494
104 121
789 296
653 107
1268 303
295 780
411 357
1230 302
34 46
278 268
262 488
278 350
68 303
454 115
273 1194
562 317
734 899
982 322
553 349
1124 844
277 428
32 45
278 630
278 500
1246 463
378 1029
414 588
466 311
262 933
1288 279
117 264
1144 322
735 121
267 322
271 110
621 301
387 331
267 567
260 295
117 108
390 111
260 1184
117 115
288 290
935 959
616 1319
366 121
1302 103
1290 394
105 339
621 290
260 312
650 1287
584 109
738 322
1092 264
442 365
579 326
473 648
280 326
117 1048
588 111
72 1407
700 308
32 538
708 104
271 119
802 264
412 116
686 121
1229 102
508 353
32 75
303 115
745 341
271 264
99 669
720 1018
278 848
258 400
1074 264
1038 542
482 350
280 288
1046 322
549 314
259 314
1128 264
1316 620
914 115
630 546
32 366
1146 1380
686 115
269 374
1311 1035
697 591
949 933
33 543
1215 268
425 394
278 314
269 311
821 322
310 877
275 111
967 428
100 115
108 102
269 456
296 115
1269 735
282 1104
746 397
359 989
268 264
269 293
448 301
115 112
1428 437
277 925
1437 397
482 109
1214 768
1067 487
281 494
292 386
258 494
1175 311
412 377
560 326
267 435
1006 115
411 108
686 825
1056 1284
259 591
46 543
292 499
97 118
110 279
327 317
295 478
260 542
105 385
270 307
1132 314
1317 264
552 1421
527 499
292 117
1445 1376
630 284
287 271
1262 295
613 535
39 307
277 1180
448 296
388 115
1492 1332
282 729
1212 852
613 107
1159 289
755 822
373 1307
378 303
336 97
101 101
79 75
1136 899
635 289
369 386
949 620
614 1058
898 264
1173 867
1062 787
115 477
97 342
672 268
300 338
334 594
373 1031
524 119
512 974
273 494
548 1201
114 322
613 104
350 317
99 264
114 264
485 601
997 264
1440 816
273 400
1355 1486
103 303
281 777
667 1178
453 117
262 312
1102 290
97 611
823 290
277 848
657 764
1416 897
282 105
281 1270
1466 308
581 115
1019 264
339 121
272 112
1043 115
483 121
791 112
336 112
1112 107
281 312
592 115
101 271
401 688
111 284
886 695
468 317
109 300
273 462
692 1097
505 311
302 290
514 499
1578 906
672 108
697 291
809 121
295 264
114 311
79 104
706 1245
466 108
296 338
281 288
283 110
534 618
1089 602
637 1018
282 312
450 288
800 1156
289 478
901 302
466 500
84 257
366 99
100 279
260 274
1356 115
665 322
1195 264
108 290
298 291
311 116
262 303
356 300
333 431
312 279
1117 115
807 120
282 560
955 1033
562 295
1406 121
533 307
1518 274
111 115
508 634
109 264
282 295
448 456
629 121
878 289
1569 483
1102 264
270 576
685 303
258 1321
269 431
109 101
66 321
300 103
101 320
1054 1359
322 279
273 1476
589 261
282 271
957 290
122 122
412 307
282 296
260 989
390 568
734 115
475 264
1063 279
505 571
655 101
378 813
435 103
760 105
809 98
336 317
1300 959
970 764
79 921
1174 560
330 103
1136 407
260 431
111 108
103 115
302 109
276 432
1044 115
323 312
105 120
77 1031
509 101
1204 116
260 444
1015 121
260 1599
117 620
1308 121
1659 312
289 317
592 365
99 308
333 770
1485 121
281 1339
370 288
115 119
553 605
613 264
421 1692
374 385
1400 394
282 311
444 317
373 974
1006 487
414 476
857 279
665 751
285 119
955 338
1556 1699
534 300
267 1611
262 1603
1056 339
858 112
1704 487
1060 353
926 385
417 1033
122 101
1138 268
112 104
102 819
821 420
1224 377
609 111
599 108
411 594
633 756
373 114
1211 1304
587 111
356 677
809 268
333 1338
633 420
308 546
262 268
277 1378
105 271
1726 312
512 848
117 274
562 1501
101 288
1286 407
1254 1422
372 308
337 117
373 1514
267 1395
1619 623
448 643
260 1314
973 1545
1103 1436
1211 1561
267 288
637 1279
745 365
496 290
297 655
1001 1340
391 104
372 109
281 1761
87 1347
115 312
1088 1526
282 97
553 1453
453 101
105 611
83 535
337 271
302 264
1054 279
109 290
101 568
72 105
305 1412
1310 611
280 1689
983 115
282 1179
267 688
100 101
1379 108
1447 773
731 1255
298 1637
281 1675
984 290
334 101
466 114
393 1600
293 386
1103 99
1665 341
540 110
267 1141
280 407
385 909
1452 1178
269 330
98 591
746 817
573 1586
280 476
424 380
337 629
323 264
277 662
1003 1740
267 629
281 268
461 116
880 1049
260 1800
534 561
1157 264
1509 312
274 290
926 721
267 1819
341 108
654 115
63 543
609 1242
774 290
266 882
1399 727
1810 397
1167 286
505 1551
579 307
1472 308
1431 121
342 290
419 116
282 420
842 1682
337 735
105 279
1368 341
302 115
1463 377
706 1525
98 114
66 296
289 817
1710 396
621 551
344 391
1209 517
1802 392
266 1125
429 938
672 1674
302 1535
269 274
1815 392
1855 98
282 683
302 100
414 111
292 1661
662 110
1618 338
428 901
869 1139
262 551
371 537
267 296
772 1653
453 1865
327 454
814 279
273 910
105 591
277 1202
1795 1794
101 357
104 111
278 426
514 542
498 98
373 498
109 386
287 314
99 121
101 107
507 1685
389 290
429 323
298 1149
319 365
276 751
387 296
1022 322
65 656
590 115
347 1149
997 115
945 867
1386 317
1719 677
276 303
281 1196
1026 115
1233 290
32 345
722 272
370 307
450 97
276 1696
1084 308
362 1765
1905 1392
661 121
99 906
32 79
1174 542
678 121
272 110
278 652
1679 702
1772 312
356 1049
1745 1904
266 109
262 733
273 1590
281 815
1180 475
281 295
390 655
390 593
772 1579
745 437
282 845
1124 288
1162 121
1086 768
297 1940
260 1562
337 288
390 509
262 684
337 844
1705 108
534 290
465 817
453 288
98 322
922 264
1724 1621
319 118
479 112
262 257
121 454
277 1162
68 111
119 454
501 1958
529 1626
275 119
97 291
32 317
1479 560
1368 611
282 104
971 115
1162 279
307 111
1241 729
116 115
1812 312
278 317
357 322
99 317
1938 308
621 336
1001 109
411 1464
1159 756
697 557
1021 291
742 1156
305 822
780 115
1934 317
115 121
434 380
640 377
282 925
1181 108
277 322
32 341
887 339
1871 385
1096 115
259 102
374 103
274 121
1067 264
1439 121
273 274
258 879
285 98
324 1295
507 397
260 1891
297 604
1107 1952
317 101
278 1971
697 1029
281 500
281 357
102 733
277 272
404 688
116 111
271 357
1335 290
395 490
791 317
1548 538
1468 115
1015 1125
282 330
111 103
579 295
268 290
277 314
485 343
1708 385
428 293
1967 437
342 279
111 397
2000 2036
99 290
293 783
1357 320
281 291
953 320
320 264
466 1097
584 307
83 638
1292 101
573 426
260 521
267 1922
97 308
378 353
365 290
719 770
1300 684
79 102
662 115
590 101
259 901
1123 696
1627 1329
117 354
404 290
333 399
99 279
115 99
280 1972
829 396
536 2028
273 290
276 784
667 98
703 1570
583 1820
308 116
747 648
869 2013
84 301
1964 1024
312 104
346 2021
686 905
708 490
360 115
1324 454
1873 1247
292 1666
267 735
1500 535
412 108
1088 1181
485 104
389 1456
1062 357
72 1247
288 112
411 116
112 264
832 567
905 815
378 673
404 521
103 704
1157 101
282 1642
1366 119
1504 648
340 307
579 1273
1381 1775
319 99
1709 308
281 652
390 2099
262 428
260 808
791 1720
103 103
110 669
1894 1880
401 652
2044 107
1106 290
2100 850
372 288
1399 331
466 268
407 109
1879 620
372 613
747 2103
116 296
277 634
112 97
466 111
585 115
276 1629
1112 349
269 1339
706 550
1527 1093
1060 852
1833 897
292 1276
274 385
533 357
32 386
468 290
267 618
720 499
269 302
1597 696
276 1295
829 104
277 101
273 300
1221 119
98 400
114 399
389 296
1084 996
366 115
591 109
314 116
1729 2166
530 312
812 101
281 594
262 284
442 852
2076 2056
854 73
71 488
2172 300
356 918
404 1196
1645 115
1799 1680
101 98
282 804
1328 121
1294 115
635 456
262 431
111 341
303 116
336 264
117 98
97 462
840 109
372 567
466 293
851 320
1831 1419
587 311
281 1488
1910 591
279 394
261 2137
1200 1572
1655 115
322 264
945 109
1861 303
282 1141
323 115
282 456
524 1276
333 1677
282 509
390 2032
2198 897
1372 264
1003 2189
269 303
1837 303
306 322
282 1867
1373 1093
1739 264
1200 328
1813 321
2180 386
67 396
259 112
592 100
635 407
1982 897
298 102
294 532
955 1538
869 279
742 1111
282 288
760 604
111 261
1084 1776
448 432
401 1490
706 1647
450 295
880 594
659 1304
1449 1575
289 97
821 432
305 268
279 116
262 825
427 1184
834 394
260 462
1695 279
602 318
1451 564
370 1389
373 2096
1472 394
1860 302
328 397
267 500
2154 397
1060 677
294 116
1926 317
447 317
603 308
1597 385
412 624
1589 613
117 112
1878 279
915 937
1385 288
1447 116
281 264
390 114
101 296
1239 317
1239 112
985 1950
378 341
281 463
278 105
295 111
1622 264
277 454
738 293
1328 264
110 483
338 300
427 104
285 2294
926 342
1175 716
961 2293
967 111
277 97
1118 1784
2171 815
466 386
1357 341
880 2083
260 279
546 264
389 121
74 111
1969 499
285 740
282 300
282 662
589 365
324 101
108 97
277 2131
1280 264
1047 494
324 2248
1173 560
1576 426
2195 279
812 122
524 312
549 1978
374 107
276 286
553 109
333 290
411 99
498 860
496 487
276 357
359 101
372 1839
262 947
609 521
270 341
281 1932
298 108
267 300
1762 98
1112 557
303 317
533 98
807 326
390 121
277 476
1928 1857
260 366
1723 1994
258 293
466 2022
2186 980
902 1615
288 783
596 101
917 463
32 1314
686 1803
258 374
579 268
807 311
2019 385
1038 688
706 905
2335 1604
1480 290
1533 290
1863 793
2233 1201
1620 115
262 440
609 1694
446 108
330 477
267 885
337 702
308 120
288 428
1477 115
112 279
2344 2382
77 121
1462 290
282 909
277 1436
32 39
1051 290
509 104
682 101
2347 311
1892 108
337 602
2143 308
109 111
949 733
340 1454
334 307
277 328
110 311
407 115
1489 115
337 314
295 302
598 1640
2352 2018
259 354
281 1031
484 2403
800 290
337 428
2353 751
737 1279
1385 116
352 108
1328 101
466 101
411 112
275 1321
269 498
282 308
276 2358
1767 119
297 312
1324 120
298 323
1212 102
512 288
1303 264
308 1846
1755 349
2354 121
759 121
2343 300
283 104
1792 286
337 499
2158 2433
111 326
622 115
292 296
505 793
80 1104
359 117
1366 98
2057 487
911 662
83 116
624 121
2001 308
902 1104
280 108
117 905
314 100
111 268
281 1848
278 1615
453 2453
330 279
288 109
1644 264
2460 109
371 1961
2385 2308
294 396
2395 770
2218 604
873 290
1242 115
588 121
267 295
610 302
100 783
722 643
280 844
745 303
302 426
1133 115
275 86
390 2167
1500 716
390 1389
2310 104
97 557
880 97
2398 365
497 1953
1805 115
1766 2458
2119 1422
616 303
530 1977
121 290
584 740
537 1090
401 289
337 488
2444 279
1996 2498
2095 804
267 407
530 677
508 1670
1473 394
324 403
1062 1141
356 751
2295 2190
514 2489
110 264
1762 112
260 662
665 286
100 308
789 119
1176 115
2514 773
2210 322
32 90
103 2162
303 121
292 613
1589 1536
2124 308
373 976
105 300
1269 488
340 602
267 279
946 2452
573 605
100 296
1144 264
485 1347
508 109
643 114
288 108
507 1453
118 623
298 341
1582 538
2492 1093
1721 115
269 2060
297 321
274 407
1769 119
263 397
2093 538
104 268
302 107
700 1464
312 115
359 111
1601 394
447 326
87 762
279 112
2555 2549
404 2163
83 336
390 947
282 286
268 97
267 1773
462 397
276 815
2501 623
1003 2539
258 604
1462 2535
697 1053
2486 110
1840 290
333 357
2431 102
2316 111
596 102
869 119
2127 264
2225 317
282 2325
707 290
665 1562
269 462
1730 115
2133 121
633 322
1025 1498
1582 688
2246 1035
270 852
874 1179
260 2378
1070 332
390 440
282 350
450 264
887 1454
529 107
2465 1461
107 268
2451 509
2243 308
2108 487
1349 487
102 108
505 1179
297 279
282 314
2160 1490
273 330
359 114
1387 121
1254 338
1782 264
278 1412
39 100
359 108
2073 279
453 2473
2612 2542
2585 97
2572 1585
466 1564
292 374
2138 291
1933 385
2159 1888
1259 121
1624 2192
119 2554
292 751
534 2042
442 323
373 500
404 1848
258 521
726 108
1039 312
524 288
411 103
97 102
524 264
281 311
352 326
262 289
2443 560
2147 264
259 118
583 688
672 302
2033 99
311 101
299 1149
713 2561
2659 456
1966 99
607 567
328 112
282 268
665 2436
635 300
293 2517
1355 2634
588 97
639 877
300 111
1196 1843
117 338
1695 1139
277 1537
370 1889
65 271
348 2135
389 279
731 451
826 852
869 365
115 652
512 2672
700 1836
880 844
112 420
103 394
83 2480
109 98
281 976
325 2688
267 850
277 735
1456 716
1089 279
1241 509
456 264
273 291
2654 1886
279 97
812 1273
2660 288
276 274
553 557
281 2667
1956 2695
512 114
298 437
697 1284
285 107
722 798
270 2106
346 317
2424 1694
1167 561
466 318
267 1579
779 115
508 103
615 101
328 102
435 288
635 875
258 386
427 557
1324 764
117 407
534 2456
258 560
295 317
2502 115
694 620
2090 951
449 546
312 101
87 1881
2116 432
277 980
115 279
614 115
108 494
971 312
84 762
277 655
281 314
2120 1090
260 2723
372 326
337 1406
1838 264
955 2041
112 2733
1966 2753
1451 1125
270 666
505 561
2279 483
297 2333
282 937
260 494
616 300
497 494
103 1670
311 115
1811 115
268 669
584 1839
372 2764
276 2496
1241 498
706 115
2557 1921
273 432
278 604
114 302
2758 815
1065 115
1923 1528
567 264
874 798
2273 477
1203 560
267 432
607 321
267 499
2622 798
32 942
1261 290
745 813
1766 1776
32 85
32 1516
508 357
1372 121
505 655
651 396
2538 303
609 1156
1418 2309
587 286
2211 115
104 97
369 115
442 397
335 102
745 118
378 1809
837 290
731 652
645 115
1798 1498
363 2523
302 121
121 407
273 289
589 1273
533 288
2749 2201
370 787
2114 1539
277 350
78 322
449 764
269 1202
292 288
489 46
479 336
1167 420
44 543
2238 1988
259 550
32 368
1038 2657
327 2030
639 115
507 1208
273 1276
2746 2776
1658 604
281 483
507 100
260 2840
599 1539
295 290
366 112
902 2736
1515 122
607 1621
744 1770
32 264
1957 366
2194 279
442 2815
276 1566
278 733
851 288
893 623
108 735
584 261
278 330
1118 1461
337 2346
268 1351
333 1490
333 506
742 100
258 1656
373 1378
450 307
1241 756
1215 386
2615 535
760 2281
2048 560
2821 1877
1591 385
874 322
281 655
728 115
333 293
116 105
869 323
1548 1564
352 655
579 2046
32 463
692 115
1610 264
1479 641
259 119
1386 311
456 105
104 947
880 336
295 1392
530 1501
610 431
990 959
1884 951
2094 2046
579 1255
802 115
267 1857
621 300
2414 119
102 483
975 462
338 864
72 2846
972 264
1708 1918
1054 366
539 115
2833 428
299 109
613 290
66 101
301 112
2048 97
87 588
449 454
2339 296
267 664
745 100
258 2462
2648 302
2908 623
258 567
809 339
1037 2907
790 1139
273 815
339 602
2504 1528
2055 264
2616 561
105 2721
2362 115
2450 487
373 288
1003 561
258 827
1000 101
305 521
1070 2039
2931 2417
1709 284
722 420
266 435
407 623
2236 1083
579 320
1896 290
1011 2938
1769 2951
428 103
393 486
700 397
112 819
497 2359
359 2669
370 2457
418 2859
1028 111
99 291
2826 980
1003 494
519 2780
301 264
895 115
1649 2966
553 100
106 897
2109 951
579 365
701 290
482 103
77 101
2033 1687
1727 115
502 290
830 2122
462 264
2532 1537
346 338
2950 104
1669 2030
1471 121
1577 115
1527 1058
609 875
1214 326
1177 662
271 846
270 261
550 121
258 279
2934 279
108 867
390 432
105 118
2550 366
876 279
105 2038
259 960
567 317
267 1488
260 291
269 2065
1496 274
889 279
1496 669
2228 2988
1011 1388
2851 783
257 357
514 2995
273 662
421 103
2082 121
466 374
2994 688
273 909
297 1671
401 2054
105 342
3015 2728
378 1846
2230 117
428 783
407 107
1074 290
278 2702
97 119
1266 115
282 759
1920 264
667 338
2118 611
2235 487
1863 339
45 2274
1658 951
2276 264
2906 860
373 1395
1050 115
2332 1862
1060 813
621 1862
2016 312
665 561
411 102
1452 2202
1411 115
722 2328
3025 407
300 704
599 114
667 261
310 111
372 844
3011 288
876 394
1669 97
2893 677
2943 308
269 2463
76 1172
2437 97
72 1570
758 394
795 317
512 506
295 535
534 3067
291 116
609 2263
1250 115
279 121
2656 996
2499 112
2998 350
2735 121
1424 264
595 365
2661 1656
121 109
447 295
1955 576
744 268
2301 98
496 115
616 634
103 121
99 1329
1565 312
282 291
947 101
1204 1058
1120 115
281 518
2968 695
1103 2909
294 2392
102 925
719 101
607 1536
2232 1392
278 2257
1837 1419
738 1770
1976 1314
1746 678
547 560
453 420
2118 112
3030 1090
3093 268
1831 303
270 339
337 848
1491 115
387 2767
1524 3107
623 317
442 103
279 426
421 3097
264 1329
1746 764
2493 487
505 286
847 111
302 783
707 115
3024 733
266 925
1543 115
1003 2042
121 101
508 300
1046 3135
3115 1202
1011 108
373 121
796 394
295 385
390 1656
1526 290
284 264
866 279
858 550
333 822
1424 115
2807 560
466 770
269 3127
277 2002
507 1990
633 1572
1311 751
324 3066
2007 3131
3153 338
1928 2288
790 538
273 295
667 2202
357 111
97 122
2317 2970
32 1564
3098 274
2843 264
390 500
1089 357
395 538
270 1545
112 317
583 3173
530 109
830 115
1789 264
2338 264
277 392
1134 487
2314 264
2111 115
854 950
321 104
337 350
1346 115
442 1809
1096 264
2377 115
305 117
991 341
626 394
772 1773
259 2065
119 1359
372 2121
273 2957
101 3136
533 397
260 303
111 1245
390 1977
258 1201
277 630
755 99
1383 115
273 1932
386 780
111 311
459 2681
337 2900
1439 906
288 426
370 407
1049 257
100 284
276 322
728 290
2630 264
271 307
2073 683
1416 1671
589 98
658 2188
118 538
691 487
411 2069
616 1629
2887 2257
811 279
107 110
262 2148
278 822
110 97
3205 804
3111 1090
891 1538
809 103
114 286
476 104
705 1640
363 487
268 407
529 109
2455 109
2130 899
755 103
880 308
99 1202
1127 394
746 323
268 317
1254 116
2380 385
533 1784
2237 1586
1671 623
2320 264
686 3078
2193 1198
589 119
755 3265
294 110
2105 264
333 2722
1503 264
453 336
621 101
333 295
2221 538
271 296
742 330
881 115
609 3059
390 499
747 2610
277 509
2360 264
731 330
1103 1202
274 392
277 336
105 1590
821 2581
1200 947
1515 1717
2916 1340
3237 386
565 114
1099 290
829 108
267 2679
736 264
3083 1139
269 2663
3239 561
2690 3228
1723 397
609 314
300 321
442 307
434 46
809 861
325 3305
277 499
2363 110
2418 341
1130 279
334 317
2307 1035
947 509
3280 3251
1310 407
258 976
334 787
3084 591
865 338
281 289
854 843
359 456
2213 3257
273 271
3309 3319
1204 1093
1148 115
495 2205
1327 121
483 116
745 1604
718 591
298 2673
972 290
967 3206
1011 3304
1212 813
278 643
2525 2101
649 290
809 1461
1496 454
2342 357
1698 2288
334 300
257 116
3037 2605
560 119
1451 768
779 290
505 498
268 974
393 341
300 1033
267 759
299 1454
260 729
336 2239
2976 498
462 290
327 312
630 907
1568 407
258 756
2053 338
1479 3338
672 365
266 114
635 3354
1166 110
305 2039
371 1015
567 3352
3379 2882
2287 3364
2958 2553
840 3233
32 441
99 284
269 286
1755 860
112 293
3337 110
1118 678
337 1566
2250 557
292 847
32 290
1335 115
103 117
2182 428
2613 751
435 704
1591 591
1262 751
72 322
2645 2277
3394 1539
3404 1329
3357 1990
1387 290
1418 301
2271 290
337 2472
3222 1680
327 664
83 1515
1118 1525
1746 3388
1645 112
291 773
1176 290
466 3380
1496 3417
869 655
902 101
719 3308
292 2263
609 288
854 993
99 117
1118 98
1171 110
1351 115
273 2381
1565 1179
1186 115
281 1509
1627 385
337 295
482 1535
1200 3397
3255 815
105 111
3198 666
497 922
1132 506
456 97
2848 264
1085 121
3020 366
277 462
359 1742
3039 487
3290 2701
3312 97
1181 100
1357 813
686 307
1366 1273
962 128
359 97
390 1338
283 477
2051 290
337 980
289 107
2213 2277
334 312
278 1194
45 99
1884 683
902 1307
854 904
1906 290
1601 951
491 2894
722 3192
905 780
530 407
3106 560
71 111
2601 115
102 97
3431 1877
2276 716
821 101
258 988
719 1803
116 402
650 1734
3029 974
2102 1461
791 98
3330 905
1047 1338
297 3076
340 108
839 290
282 1488
2775 630
3117 312
1861 652
411 1961
736 308
289 780
1118 1116
3405 115
1070 111
1424 290
390 1953
412 2381
350 99
2600 1717
1572 121
926 714
3212 3453
442 357
2150 104
560 102
105 678
2029 101
3496 110
3432 780
755 1823
1046 368
3109 2742
305 3446
580 394
3213 272
800 3360
844 104
268 338
3515 1388
1957 2165
1976 107
3191 543
847 386
1183 121
1352 290
262 1737
2094 320
2128 394
1985 2428
371 107
926 274
297 3468
258 847
3108 349
806 121
1649 648
1290 3000
97 882
984 365
466 2698
3325 2078
3374 110
333 435
292 498
1231 115
108 328
411 338
755 118
1565 321
259 3017
1792 290
98 951
742 1604
1054 683
3385 1720
712 1974
2007 2974
588 330
262 290
267 386
421 120
277 1570
2255 102
1649 3396
372 3248
703 3569
1007 2513
1363 115
2138 339
282 322
706 112
103 604
2423 591
1011 3566
2653 111
395 101
282 677
3585 1090
1926 264
89 286
483 906
3284 1642
1767 308
1138 1823
926 2384
913 394
45 97
698 279
2291 317
3572 1035
105 1029
417 3583
512 2054
791 619
763 543
337 420
2785 101
1138 112
3436 798
512 3217
79 119
1503 290
1607 290
2402 557
1565 2078
378 122
3314 366
3465 308
2441 751
1881 365
281 366
1602 121
1712 2088
592 905
352 3480
297 1965
3069 1734
512 1488
902 2642
862 121
745 308
1089 2646
2230 798
297 2569
1229 109
315 271
32 279
390 321
3499 386
873 115
3513 804
1440 103
292 3621
1714 264
2157 2540
411 1950
3425 1775
1239 323
967 716
429 295
492 317
902 295
2019 3031
509 1388
327 3549
607 662
901 3655
1167 918
277 827
1280 290
282 2524
3573 407
267 875
2160 3592
483 317
45 2442
891 740
821 3044
3660 475
3497 121
2297 819
258 462
2867 3358
609 2917
1011 1338
324 593
2238 780
3521 1677
1049 906
3467 848
1261 279
1239 1639
635 105
277 1566
2792 110
1397 116
117 100
3560 279
285 3658
1814 1867
1118 996
2109 108
2285 394
260 318
874 3511
2350 1097
1011 1687
947 115
3577 386
72 101
281 286
1556 2671
1345 377
2420 264
1838 980
1080 860
390 2487
273 117
3253 312
3550 407
802 308
3625 1498
3673 1561
111 101
1833 288
2237 555
2092 115
365 350
257 476
854 1030
2588 426
2680 264
1969 311
3617 454
296 426
279 1090
302 677
97 1048
117 1921
514 2251
117 261
3326 3727
77 641
305 3516
103 643
337 1351
2649 1841
3010 279
719 2038
338 264
258 1509
456 560
720 1279
278 435
1088 3736
267 1564
1228 1575
755 279
573 112
1452 338
105 604
2336 954
2650 906
115 317
99 321
450 407
411 2683
276 264
635 431
334 602
2361 3728
3598 293
2091 980
1133 683
1181 97
2937 560
512 3279
2578 3440
496 1734
2053 1538
116 478
1138 905
1679 2239
71 716
508 1536
2421 101
2221 1032
592 1048
390 815
609 1528
2074 115
3691 716
915 295
281 456
2406 1539
2822 1674
1769 602
2380 696
507 2727
462 98
305 2022
1993 97
858 907
282 735
609 3730
266 793
498 1340
3518 303
453 312
292 314
2272 560
3520 751
99 1994
294 104
73 102
505 2191
3804 105
722 759
1923 3791
302 1090
2475 751
2082 560
579 3766
1127 279
453 435
3784 1329
2396 115
288 2529
258 1737
3175 716
1576 577
2231 487
285 3772
2119 3741
2081 377
1910 3563
2760 264
1669 268
304 877
97 349
267 312
285 3719
110 1097
2694 308
281 435
1061 3834
448 3129
1814 483
1263 1734
541 115
282 374
258 655
527 1279
359 312
412 271
333 3517
2192 677
365 483
278 669
3750 312
720 467
1072 115
1386 101
3746 290
840 3811
1263 3848
744 947
508 509
371 116
103 110
3588 115
635 815
485 762
722 286
2548 115
270 1048
277 875
292 302
2644 487
512 1412
3559 1035
1203 3720
509 478
277 1359
495 330
483 3874
275 114
1923 677
718 3849
3530 3880
1056 3808
296 648
269 3027
2699 1680
2090 308
1956 279
324 1515
82 101
3809 312
2402 349
760 288
2455 3877
1754 115
737 1018
45 121
110 494
411 1181
282 302
485 456
314 274
1221 2428
288 328
1639 3903
269 3528
269 593
485 375
3646 560
267 350
324 989
2193 1737
969 762
258 296
501 2687
2121 290
352 288
260 386
1174 116
2474 409
103 560
772 475
3611 279
259 1240
530 613
672 847
509 108
1503 426
3271 322
279 3926
1888 1687
3919 2191
282 3100
2264 290
259 3929
760 688
1011 2687
365 2472
112 288
1995 115
2420 787
404 3904
276 293
1132 1536
306 3726
3859 454
281 1514
387 1841
466 588
2421 1242
1070 264
1059 290
3747 1687
450 3938
301 105
260 3798
2941 718
294 109
337 568
902 655
2075 115
1259 980
1062 295
670 543
808 116
3833 385
1228 2635
2423 300
436 112
1060 740
277 532
592 308
104 488
1064 108
373 3743
712 116
915 630
3869 3444
2925 604
1767 293
649 115
2835 827
3896 1742
3458 768
3850 2251
2007 2740
530 295
3684 3829
325 114
66 3142
280 2476
105 1836
466 3901
294 1378
1195 115
1239 611
3622 303
2624 2018
1589 274
359 1169
2426 115
1418 751
3876 2407
273 308
3235 798
260 2170
700 996
3959 97
1729 118
629 264
448 669
533 568
273 716
1175 634
713 115
1957 295
282 2569
3898 3861
3884 111
3099 311
299 307
340 312
258 641
282 407
2301 901
2772 490
319 397
2392 499
267 3602
2236 2170
99 105
1396 290
891 353
260 308
373 3954
2342 116
512 2442
541 290
373 567
390 555
1246 634
267 268
275 264
1346 899
333 538
285 295
1327 3756
534 1388
3683 308
101 279
686 1647
3749 3096
3463 683
2447 2997
854 503
2942 264
267 462
497 311
98 1385
508 288
407 264
4059 354
372 3289
3899 385
281 1141
2881 290
282 264
378 112
99 2671
397 498
1138 1255
2182 593
839 264
395 4071
1133 279
291 290
268 557
2762 648
276 318
1070 1624
1491 312
276 629
863 290
271 4030
3795 97
4024 1388
2095 4052
809 1029
609 3032
2437 613
1288 683
533 100
592 4069
3276 1295
1084 4083
378 1419
4023 770
4022 105
3973 4068
117 907
1945 2999
609 475
3046 426
810 115
1622 290
449 2765
3638 613
364 110
1860 662
925 483
1755 1332
390 1270
102 673
2841 114
483 279
4112 101
328 2101
3009 320
462 385
589 3732
514 716
1372 115
281 825
1070 117
619 286
411 463
352 323
4119 426
1310 787
3586 99
672 308
319 107
800 1658
314 303
2772 906
1518 576
585 1058
447 407
1271 394
3429 312
1548 2476
275 2524
1239 2209
264 121
1261 551
4113 4027
505 3151
282 357
285 108
269 716
390 1476
258 4099
3143 264
911 2060
1610 302
1386 1823
1432 2960
2203 264
1543 290
333 567
1920 115
3494 478
359 374
3146 922
1792 729
1209 365
869 1809
306 3221
366 3081
319 2683
3892 1332
3575 268
2803 1245
1160 4058
1019 290
1591 696
292 630
1088 4124
4125 4049
2553 111
298 1388
296 397
99 925
3934 918
278 716
1088 906
509 1347
1582 733
2264 115
103 317
2653 1965
838 543
1643 115
667 3181
77 718
1221 4182
4173 1528
719 1889
1919 114
97 274
3014 1083
352 291
327 594
579 4115
744 456
826 121
3365 101
1745 118
285 121
722 4186
654 551
1613 312
1157 290
300 483
2699 109
587 374
482 116
3390 279
68 357
1011 4172
114 303
2697 115
2280 2919
110 1033
2279 407
404 2309
3457 156
1349 115
1107 290
281 296
385 4213
337 284
2225 101
4207 2407
277 4168
277 1862
346 780
333 4179
4190 1090
897 264
4106 279
2114 108
282 980
390 819
4202 116
910 1717
929 110
2816 392
1555 394
2102 815
262 909
1735 478
1591 426
1822 2161
530 4230
2287 974
686 108
110 336
310 98
1418 295
607 867
3616 101
411 320
1084 108
412 98
746 4205
726 817
2290 2088
4026 901
1171 3172
72 97
2194 2201
363 279
101 1141
1873 407
3957 343
74 301
635 318
1214 557
760 274
273 850
874 2188
274 535
1088 567
448 1661
4280 4282
2750 264
258 2191
1524 115
2102 2864
4256 98
1741 115
609 4118
103 296
444 778
1503 279
1073 264
262 2359
300 121
1342 279
282 1242
97 1647
1876 122
1393 115
373 1196
258 321
615 274
744 1194
448 1385
727 261
302 867
497 932
282 274
119 2281
549 1600
621 2148
2365 2161
619 770
790 279
293 317
3832 4313
747 1765
378 101
4165 1880
2642 596
3299 638
4324 108
869 1889
621 2001
260 3089
4314 121
1712 115
2927 3930
112 101
114 494
3307 112
745 115
4306 111
607 531
731 729
1072 290
4257 386
1204 478
447 1454
719 594
742 4341
339 2078
2591 290
269 321
2646 673
747 103
1448 366
74 420
529 290
2348 279
277 4326
4277 302
99 2068
108 1179
3760 111
1789 279
77 1514
812 317
1324 108
1897 115
2613 2731
1500 264
1843 317
1073 115
285 291
404 286
1003 531
4336 4337
4038 3920
1639 117
77 498
109 109
373 286
858 3475
352 4357
4247 1575
579 407
122 1273
4329 4363
46 46
269 4367
277 1090
2068 1624
672 611
276 4374
2338 101
97 98
282 815
1814 3216
260 4346
3008 121
77 1307
3581 1604
4355 1642
1746 100
589 2740
2300 100
271 666
1474 2135
101 102
370 1276
630 100
378 852
281 509
2441 1585
2816 490
259 120
333 311
260 3529
1138 291
335 543
1603 396
3035 115
1021 1717
3724 111
274 317
2835 97
2255 2162
270 813
4033 864
3483 787
421 385
1089 288
374 2896
3801 4349
703 4406
4237 4387
672 339
621 1566
112 308
4003 97
1527 1974
304 385
1527 116
2878 290
1228 4317
304 543
267 4245
110 1247
4358 317
926 98
635 312
4350 4444
503 114
2066 3224
3183 4310
4305 302
1772 1149
2363 97
32 4133
411 341
4079 560
635 604
1464 655
1596 2404
807 103
2116 1270
4411 101
2267 101
3605 475
3664 2161
955 2068
2339 1456
1272 354
392 111
32 330
582 4458
4452 1015
789 4143
2158 4075
1506 115
323 1247
700 4476
4470 3557
260 314
3878 798
665 268
385 560
4426 302
4394 303
630 2069
3292 264
4176 2068
3596 4469
2978 798
1759 2605
2559 296
117 317
2658 290
1631 2529
1138 341
1626 105
744 2167
4485 1677
337 3729
3544 4434
1011 596
552 910
1132 101
686 426
4496 2896
263 1295
1088 3427
4501 1671
774 296
738 3005
1710 3152
450 613
929 279
1200 3005
1684 394
2169 290
546 1877
276 402
1955 604
652 1669
2841 4498
115 290
2664 385
385 1242
607 1551
4510 121
3105 264
273 618
4519 330
279 99
282 4520
963 115
1813 279
910 107
2578 733
356 4109
1897 290
837 115
2053 2041
116 937
1933 4540
109 296
2255 4402
579 98
1049 317
104 647
719 288
4370 787
635 1498
277 4534
745 852
116 475
1133 121
3269 121
81 117
507 1823
87 4199
307 560
400 1247
858 98
4129 3171
277 568
926 1048
4302 279
679 780
726 100
99 875
289 303
108 279
599 1085
116 101
119 613
549 808
65 261
275 2567
1468 4524
1038 1820
268 349
411 4404
556 2274
2246 121
635 4559
119 2182
258 435
4529 751
582 115
1610 290
3187 1537
1070 101
2645 702
2822 98
4572 392
301 4443
479 4530
4208 1304
4573 312
552 271
2273 490
2641 312
2146 264
553 1015
609 4593
266 291
2226 115
2856 4592
4269 815
2439 264
387 1456
270 1670
3470 543
1645 842
4544 4583
760 420
1996 291
2150 1139
1466 996
880 288
2280 3399
269 288
1782 2960
4263 4566
3953 751
869 546
4036 264
1034 115
370 938
4603 312
514 2463
105 852
294 1515
1738 115
333 432
2361 1773
258 4009
4554 279
1723 538
105 437
1157 317
1814 594
2031 115
115 274
2694 996
1128 115
2179 317
1084 630
2611 1498
114 290
2143 996
2133 331
2228 476
312 121
1766 1742
3060 1321
1791 102
1826 115
2693 264
267 777
294 357
900 1058
2414 494
1615 268
4661 3819
327 1476
1168 264
1007 100
484 101
2477 264
4389 980
260 4362
635 4662
891 122
3256 1719
373 101
428 704
573 290
1613 317
4665 3368
3003 426
633 4578
295 696
293 286
728 279
333 684
1906 804
968 290
589 882
411 615
337 1090
3120 312
2389 264
285 787
267 308
2220 1640
1435 257
118 3502
337 630
4672 499
4471 279
109 318
505 4417
2499 2384
771 115
260 938
2243 996
259 321
722 555
2114 271
3002 407
277 588
3553 3171
2708 3149
1639 317
374 97
914 4567
319 102
1566 328
373 989
3707 1537
821 655
1102 3534
1229 465
901 780
284 4699
1132 3445
4694 1454
2332 4723
743 2701
4445 467
282 428
4123 768
1047 286
292 3089
665 456
4671 302
315 486
633 647
4687 604
2109 1609
282 462
672 349
3256 4695
267 456
700 108
2121 121
1128 290
284 317
3336 780
390 4716
273 804
378 2209
466 1742
1132 3294
4743 4681
66 4294
3887 3291
276 2333
3976 341
335 115
1813 116
4721 1637
2307 341
1089 4309
1310 336
2331 290
505 2581
1167 322
1720 4428
4747 974
678 560
3847 303
832 4505
496 279
599 111
3779 268
273 604
1607 951
418 110
334 2106
278 4768
2280 729
1933 1918
283 4571
633 488
547 99
587 509
986 613
1165 1015
3928 121
105 98
1686 3223
821 3294
440 115
1955 688
3422 916
104 483
292 1742
4784 980
1996 4795
3709 366
514 4334
2054 261
324 629
1109 115
613 289
277 4801
545 46
370 602
327 1629
2785 478
1894 114
4802 331
1543 296
1591 605
2532 426
108 1841
891 291
584 594
1993 426
333 322
3054 271
808 1008
68 293
2330 115
800 4821
708 409
935 1685
1174 322
928 394
4805 288
285 4804
2756 264
262 1666
682 366
289 290
278 1737
1457 290
895 290
4825 279
3152 286
973 268
282 3007
1230 295
1806 115
2150 279
79 107
4259 560
1432 619
729 121
304 847
284 932
1418 290
97 104
4619 98
411 3680
2228 4220
324 812
73 115
2232 4651
1919 4558
1366 905
4705 4850
2474 257
686 605
854 942
453 2328
1812 308
2193 314
533 311
2745 4552
3046 1537
3223 108
659 877
2890 264
4195 308
302 407
4204 115
2361 440
356 2731
87 4416
39 341
401 947
485 1881
466 555
1519 115
4262 397
409 3247
483 290
760 812
427 4886
725 121
4775 4708
334 2190
821 1551
1070 4871
114 2462
260 4839
3054 4895
891 684
99 1270
3558 4637
89 629
829 111
4897 2407
33 39
737 1125
288 105
2128 4815
266 1149
378 99
370 655
635 1049
2245 290
1021 546
4853 302
3845 1990
2925 366
415 115
1601 1609
1373 115
655 264
4169 264
298 813
2666 933
3361 264
352 2209
2447 1647
305 1884
300 3242
278 605
2297 394
1196 780
4463 341
1733 2088
330 1965
3416 506
2550 2165
453 1965
2717 290
2504 300
3629 264
266 317
120 121
512 4116
3687 951
3636 4931
1601 308
497 561
901 394
3962 257
449 311
3043 115
3656 264
416 32
902 3883
411 115
336 860
259 4482
3671 264
32 86
1798 3368
4264 4934
880 875
917 475
889 394
3526 4674
1055 770
3867 308
677 394
587 431
2798 555
278 506
299 4223
306 634
1605 115
1195 290
2475 3430
365 683
509 115
917 2188
3154 951
269 751
278 1319
4909 4181
1485 293
117 385
3351 115
902 3209
260 2919
282 819
1982 1419
4729 959
545 380
271 295
4335 290
1858 115
386 115
613 112
372 615
84 111
857 604
4563 279
4050 290
2064 394
1168 317
281 3216
4692 264
115 2002
333 1347
4861 804
110 867
4094 751
262 812
672 1245
2775 2864
1425 279
281 400
111 817
269 4746
297 1351
105 498
607 1485
278 1666
1496 121
1019 115
283 490
282 2131
874 111
390 311
3231 366
5022 290
1665 437
4645 1197
280 4641
102 988
297 499
266 271
77 4376
1594 279
262 815
4715 677
117 1784
1263 440
512 440
310 115
609 4956
281 2163
4180 980
114 109
4132 1609
1119 110
280 295
4908 798
1455 115
2588 3509
3842 733
2521 115
3060 756
4742 2088
821 3445
616 4984
466 819
5012 454
362 3937
1022 2698
4008 431
865 268
2891 101
4507 546
373 295
2313 483
1007 899
2810 264
874 2205
3676 397
1228 102
263 5048
4911 1351
1167 1696
553 397
4276 377
672 4568
340 100
2418 437
1308 115
1624 2002
907 121
372 842
1397 1058
400 296
266 462
917 1653
77 976
4847 918
1004 1395
5054 918
5076 532
363 115
2828 815
1601 996
2892 290
1955 274
2262 3972
337 121
609 4792
742 4712
1230 1585
563 385
609 5089
1015 109
2676 115
508 787
3676 5007
103 290
115 490
1678 115
5096 279
1220 317
3777 295
267 1639
357 5020
1230 2845
1303 290
3924 2984
337 5120
4481 2513
1602 397
100 111
434 44
278 3366
4422 264
2297 5017
4997 1097
985 102
5008 5109
4913 980
534 551
3187 426
282 4266
1714 115
829 295
273 321
4164 996
549 2069
83 112
5141 535
3183 2814
3686 4767
2175 543
880 5132
789 121
114 684
2146 780
1751 115
3400 115
39 46
1803 115
453 4301
4231 594
87 375
847 1066
967 488
292 643
2650 3224
2062 1682
607 488
2094 358
4241 3688
450 119
4798 308
258 431
276 331
45 3247
457 115
747 5151
289 490
2522 3715
3721 543
118 312
530 2205
300 648
108 115
1927 115
3988 783
4594 684
1985 1575
498 591
276 1658
1118 905
610 3502
2582 264
279 111
4910 303
800 1639
3985 341
5187 980
1011 688
3697 115
352 271
5143 268
3167 317
105 683
512 462
2157 114
672 4517
1070 97
266 101
400 322
99 996
747 2742
274 867
2348 264
3448 951
3307 2101
333 643
3103 264
466 456
277 1270
359 2083
260 947
117 290
2146 290
32 4555
32 120
667 4333
115 303
2468 499
4533 407
83 104
5050 338
2168 115
267 787
2949 115
809 3915
4589 377
1143 320
2341 115
947 1886
267 317
101 264
3889 846
2291 290
1004 500
519 980
4998 5237
589 293
312 385
78 311
4867 290
378 323
753 264
99 1035
1384 289
1215 475
743 279
66 932
3909 2209
448 101
111 437
3287 115
3519 115
114 114
830 394
1596 1093
744 3991
599 630
3350 317
2244 115
98 683
2649 5201
5027 852
466 4545
122 567
1041 264
3558 716
968 279
579 2038
372 1340
738 538
900 115
324 4713
292 475
1445 798
622 261
2867 1139
5193 683
119 3032
448 300
761 5273
5283 286
792 1918
628 2135
2029 115
1200 1770
284 613
448 336
109 777
2124 1609
1644 115
292 3172
5238 431
45 397
854 1034
2232 4906
334 103
2801 264
87 456
719 1139
2427 2635
678 951
466 274
372 1048
5101 1351
2877 290
373 4875
1142 115
613 317
874 2679
1356 296
1046 311
3576 615
1668 5286
2194 308
330 5272
645 3096
1973 115
4487 121
314 112
370 494
297 1689
3288 115
1814 1197
65 108
4283 1421
891 959
438 110
89 498
1238 543
108 3715
334 295
45 735
1565 4298
4308 560
281 1599
2693 290
346 3203
102 121
257 365
34 44
262 271
387 3752
622 1273
891 2041
534 293
1366 1525
294 1169
2047 115
273 264
5078 121
3805 1389
3686 1687
3423 115
2124 951
2600 338
294 535
74 456
5301 1889
1159 5294
530 322
2588 605
355 116
790 4114
1418 286
79 4985
3909 323
2157 5338
1795 284
562 2690
4820 1525
282 867
917 847
607 655
1105 115
851 1389
110 560
5254 1351
3416 568
5380 5268
1379 264
2708 4680
5370 2814
479 97
4067 115
357 264
336 98
3966 115
4215 101
3889 620
854 1131
2661 4920
2668 115
4229 117
5353 4189
1112 386
1730 264
1046 321
1480 551
412 100
4455 4060
2133 1841
872 101
997 290
791 5346
1739 115
4148 716
865 261
1266 264
902 114
2870 290
277 601
1449 2161
100 560
4017 1083
5376 619
1007 110
1262 864
412 109
1645 5251
1644 2069
4658 394
3193 112
592 2997
4147 100
725 905
359 121
262 293
1241 4076
260 551
4942 4293
1025 115
706 342
412 110
2157 5327
897 535
5320 432
3687 308
4988 308
99 99
5311 819
2360 279
5271 2894
3924 3366
738 947
1229 696
276 5443
267 2346
2307 437
1084 1742
1067 115
3210 115
1064 3666
1051 115
854 1207
32 1823
3154 308
4066 407
637 1125
66 989
282 2148
2120 264
4597 3534
4990 1877
2656 1388
1107 264
285 5086
1048 483
635 3336
258 947
352 568
495 322
720 3486
1138 611
277 407
554 1640
1200 5323
1328 317
5295 560
5428 1656
3014 2170
1292 1058
3825 264
1386 1836
563 103
1924 115
1596 115
829 2317
2186 567
5463 5178
1254 478
3810 264
902 947
270 652
4849 115
1381 115
267 374
1919 108
1138 5475
2221 4887
1310 366
1949 290
4045 115
5391 4948
1681 115
1263 264
1623 290
2062 3002
3365 317
4928 104
512 2663
1695 683
324 117
812 290
4148 4629
4218 764
105 296
109 591
2272 101
4047 477
114 115
5103 308
1763 115
352 787
1147 5085
599 302
289 906
460 5127
110 4273
1062 2487
549 3475
1063 264
411 308
1046 2567
1251 98
3526 3031
854 1358
1418 101
5199 1585
497 518
359 330
508 1276
284 290
109 506
832 980
1666 121
5496 683
3627 115
1070 932
1871 4273
896 2523
483 1202
3867 996
4902 1181
1011 5559
580 2122
287 397
386 121
324 1629
415 543
1724 3209
478 1125
3146 1953
463 97
4017 2170
278 988
646 3937
1262 1351
1323 290
3061 5296
285 5438
652 296
1211 4977
562 5525
260 1675
869 102
774 115
373 357
5405 773
3582 291
105 107
5144 311
388 290
1185 5551
809 2106
277 1656
967 114
3193 3181
1793 115
5205 1082
5495 1737
352 1389
3707 426
2233 490
308 121
800 3044
2538 1419
1919 119
1067 290
5006 290
3842 933
292 1653
83 257
893 291
273 5246
2828 1461
297 4114
306 509
3013 264
1613 2513
973 103
277 849
1605 117
2171 3260
1906 780
275 879
3321 290
2978 1376
452 97
1565 308
3099 317
4258 115
1876 1717
4430 808
108 296
2406 4647
324 1385
71 428
333 1770
5108 783
258 3399
3845 773
4399 988
1228 4542
275 989
267 318
267 506
270 3915
2203 290
1879 115
5476 2814
5252 5034
76 403
829 2540
5349 323
4810 3964
4785 2201
1917 115
1735 899
3459 290
3557 557
5504 5010
4707 875
567 1194
2147 290
2363 101
100 290
79 114
281 538
479 274
5075 494
5535 1843
1735 1486
2680 290
260 105
738 1551
3514 264
880 2917
719 366
2475 1585
120 117
1976 279
2297 3000
1144 290
4108 3972
450 5661
896 5536
3636 274
45 5658
2761 115
2641 2556
421 110
5442 121
2313 4899
306 5517
4010 560
111 104
5304 268
4056 1535
719 2540
2881 317
5672 1380
719 3680
5634 117
1789 290
294 108
5540 1694
1261 115
370 2378
787 121
3483 3831
5069 116
483 97
412 2065
117 5678
463 121
46 39
5133 1794
990 2170
5653 1988
2447 5156
97 996
2195 683
2443 300
4430 2673
276 5712
3779 1255
278 336
1215 630
45 98
900 543
2664 696
686 2476
2418 321
5407 336
1200 5191
3175 780
412 1921
1254 1093
3132 290
442 813
616 293
1919 321
1246 97
829 288
1856 115
319 385
1214 349
800 629
854 1161
929 683
267 1696
743 268
324 1395
1302 2056
276 3260
411 1104
2176 1113
610 4319
2090 1609
4270 1245
1056 284
1142 2681
370 98
1993 366
3391 115
4495 307
985 317
110 317
5277 4293
854 1408
337 1242
337 2148
678 290
2267 509
4215 317
5542 435
260 4319
111 264
665 677
5202 605
3457 157
800 551
258 301
296 97
97 289
2016 115
1118 4569
719 844
103 683
69 120
264 5766
5789 1125
3777 1585
1357 353
968 115
552 111
2796 115
672 557
854 1630
677 97
89 101
4766 100
286 115
1118 268
359 314
1254 1974
107 1255
4047 906
2105 290
3262 290
4762 264
337 290
1860 1843
485 5790
5005 264
373 476
314 97
281 925
322 683
1320 290
266 3897
2215 264
1038 4420
1203 867
324 272
600 3897
2522 1572
4492 1125
347 1015
1975 115
3847 1419
118 97
106 336
3964 4968
2882 604
613 477
98 867
781 5833
111 764
294 5798
1175 105
635 386
2237 349
258 368
521 121
1729 2974
3685 290
352 3831
122 560
5644 394
2825 115
2053 1888
332 112
324 5571
521 264
359 793
350 980
448 117
3538 290
104 1255
275 5826
5544 543
372 925
4339 1609
4955 2417
1956 897
3574 770
712 1058
991 308
278 386
854 1764
262 604
2076 365
65 104
635 2205
5842 535
5299 264
558 111
4739 1539
5023 115
1310 602
944 3203
1214 5835
390 922
334 454
2807 867
5619 1035
5851 4239
5372 2317
122 296
5257 1048
4621 264
3581 683
3009 1590
306 3209
1015 756
3485 115
2150 1737
436 397
5726 108
2641 308
2629 115
3988 704
5618 1419
5520 339
2062 264
973 2106
1011 5886
5723 426
264 5664
713 1918
279 110
85 104
613 303
281 2096
1569 5208
2582 290
971 290
607 295
549 98
5918 3509
5627 1093
2958 5858
3670 115
5767 1888
633 729
5631 264
374 101
4835 4722
609 3699
2218 107
4512 303
1627 3291
3193 339
1075 1528
324 2702
2848 290
1479 5832
267 756
372 494
738 301
643 264
2615 2984
1802 5347
3459 264
306 97
1302 5888
3029 3819
5731 780
1215 604
971 264
4957 341
1739 290
609 5316
1055 1049
2314 290
1504 3242
3494 852
262 399
464 115
1167 1884
3390 290
317 396
258 105
590 5113
1357 852
337 1389
712 1093
821 1965
82 5160
533 1389
854 1587
951 783
4241 5041
45 102
1613 2556
83 532
281 1295
5976 105
2232 279
2544 1575
3448 394
5620 1351
1040 115
102 274
789 312
2891 5961
484 543
1099 2728
118 268
4703 115
707 5971
274 1392
314 1974
32 843
1782 290
390 1461
2662 115
479 2803
278 568
4939 2041
356 5565
622 5847
722 117
347 543
1933 696
1054 2165
378 264
1385 1974
597 2635
460 5983
1015 822
5939 121
865 358
1243 861
6002 394
1280 115
448 1049
1485 105
2224 2999
2235 290
280 366
262 5908
447 2404
2012 115
5831 613
4180 3007
74 643
829 5713
3427 397
305 4993
4999 1125
5423 733
1627 1093
277 4266
1678 551
1725 290
5703 322
1263 290
2093 668
902 4848
2578 5534
2978 5220
584 120
5222 420
1838 290
5788 6028
860 116
1607 1609
2439 290
3162 290
1051 279
5997 5940
105 288
292 101
4132 308
2325 560
1203 115
1133 290
282 391
296 1978
2016 683
2648 780
1105 279
4833 264
5432 951
1607 108
738 264
301 1340
926 1193
519 101
87 472
260 467
541 951
821 1658
4560 317
3235 1376
466 1395
1038 2163
3344 121
4495 951
1955 1820
267 328
257 1972
1956 4239
6016 932
448 303
334 357
738 655
1292 115
1709 996
277 386
2631 290
1496 604
275 638
1233 279
5021 302
4455 407
373 303
701 115
280 1485
308 101
1744 317
1500 290
4590 1093
273 476
3162 264
5799 4852
5377 1609
5953 264
273 314
1428 341
1591 5855
373 521
4308 718
112 688
3049 264
5783 867
324 6055
2972 115
5167 264
609 629
589 112
4384 46
3985 437
4283 910
110 1041
324 5782
4010 5710
1698 115
278 6116
5515 5210
2801 279
6109 109
5781 279
902 3027
1767 6024
2149 115
373 291
3537 115
